#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/imagebuilder/imagebuilder-stable/runs/run-mnEYYonCw2s3nnsg

Waiting for the plan to start...

Terraform v0.14.0
Configuring remote state backend...
Initializing Terraform configuration...
aws_cloudwatch_log_group.external_composer: Refreshing state... [id=external_composer_stable]
aws_iam_user.imagebuilder_worker: Refreshing state... [id=imagebuilder_worker_stable]
aws_cloudwatch_log_group.pozorbot_cloudwatch_logs: Refreshing state... [id=/aws/lambda/pozorbot_stable]
aws_iam_user.packer: Refreshing state... [id=packer_stable]
aws_s3_bucket.imagebuilder_s3: Refreshing state... [id=imagebuilder.service.stable]
aws_cloudwatch_log_group.internal_composer: Refreshing state... [id=internal_composer_stable]
aws_sqs_queue.image_builder_pozorbot: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/933752197999/image-builder-pozorbot-stable]
aws_iam_role.spot_fleet_tagging_role: Refreshing state... [id=imagebuilder_spot_fleet_role_stable]
aws_iam_policy.vmimport_ec2: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_ec2_stable]
aws_iam_policy.packer: Refreshing state... [id=arn:aws:iam::933752197999:policy/packer_stable]
aws_iam_role.pozorbot_lambda_role: Refreshing state... [id=pozorbot_lambda_role_stable]
aws_iam_role.internal_composer: Refreshing state... [id=internal_composer_stable]
aws_iam_role.internal_worker: Refreshing state... [id=internal_worker_stable]
aws_iam_role.external_worker: Refreshing state... [id=external_worker_stable]
aws_iam_role.external_composer: Refreshing state... [id=external_composer_stable]
aws_cloudwatch_log_stream.external_composer_syslog: Refreshing state... [id=external_composer_syslog]
aws_iam_policy.vmimport_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_s3_stable]
aws_iam_role.vmimport: Refreshing state... [id=vmimport_stable]
aws_iam_policy.spotfleet_iam_spot_policy: Refreshing state... [id=arn:aws:iam::933752197999:policy/spotfleet_iam_spot_policy_stable]
aws_iam_role_policy_attachment.spotfleet_iam_role_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_stable-20201204205417226300000005]
aws_iam_policy.internal_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_composer_read_keys_stable]
aws_cloudwatch_log_stream.internal_composer_syslog: Refreshing state... [id=internal_composer_syslog]
aws_iam_policy.pozorbot_lambda_cloudwatch: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_lambda_cloudwatch_stable]
aws_lambda_function.pozorbot_lambda: Refreshing state... [id=pozorbot_stable]
aws_iam_user_policy_attachment.imagebuilder_vmimport: Refreshing state... [id=imagebuilder_worker_stable-20210121192700351400000002]
aws_iam_user_policy_attachment.packer: Refreshing state... [id=packer_stable-20201204205416966800000003]
aws_iam_policy.external_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_composer_read_keys_stable]
aws_iam_instance_profile.internal_composer: Refreshing state... [id=internal_composer_stable]
aws_iam_instance_profile.external_composer: Refreshing state... [id=external_composer_stable]
aws_iam_instance_profile.internal_worker: Refreshing state... [id=internal_worker_stable]
aws_iam_instance_profile.external_worker: Refreshing state... [id=external_worker_stable]
aws_iam_policy.internal_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_worker_read_keys_stable]
aws_iam_policy.pozorbot_read_secrets: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_read_secrets_stable]
aws_iam_policy.external_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_worker_read_keys_stable]
aws_iam_policy.pozorbot_lambda_sqs: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_lambda_sqs_stable]
aws_vpc_endpoint.external_vpc_s3: Refreshing state... [id=vpce-08911eae9abd84cf6]
aws_iam_policy.pozorbot_client_sqs: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_client_sqs_stable]
aws_security_group.external_workers: Refreshing state... [id=sg-0101286a377e77349]
aws_security_group.external_vpc_endpoints: Refreshing state... [id=sg-0ae86ea746d175eef]
aws_iam_role_policy_attachment.vmimport_ec2: Refreshing state... [id=vmimport_stable-20210121192700349000000001]
aws_iam_role_policy_attachment.spotfleet_iam_spot_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_stable-20201204205417237900000006]
aws_vpc_endpoint.internal_vpc_s3: Refreshing state... [id=vpce-06923f1c47108b9a0]
aws_security_group.internal_allow_egress: Refreshing state... [id=sg-02523067c19e4d4ba]
aws_security_group.internal_allow_trusted: Refreshing state... [id=sg-07a88a5868e40dd45]
aws_iam_role_policy_attachment.vmimport_s3: Refreshing state... [id=vmimport_stable-20210121192700353500000003]
aws_iam_role_policy_attachment.internal_composer_read_keys: Refreshing state... [id=internal_composer_stable-20201204205417038600000004]
aws_iam_role_policy_attachment.pozorbot_lambda_cloudwatch: Refreshing state... [id=pozorbot_lambda_role_stable-20210128142934423800000002]
aws_iam_policy.external_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_cloudwatch_logging_stable]
aws_iam_role_policy_attachment.external_composer_read_keys: Refreshing state... [id=external_composer_stable-20210121142052939600000001]
aws_iam_role_policy_attachment.internal_worker_read_keys: Refreshing state... [id=internal_worker_stable-20201204205417404800000008]
aws_lambda_event_source_mapping.pozorbot_sqs: Refreshing state... [id=1bf38e95-9b24-4495-a732-2ead00868a91]
aws_iam_policy.imagebuilder_workers_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/imagebuilder_workers_s3_stable]
aws_iam_role_policy_attachment.pozorbot_lambda_secrets: Refreshing state... [id=pozorbot_lambda_role_stable-20210128142934236300000001]
aws_iam_role_policy_attachment.internal_pozorbot_composer: Refreshing state... [id=internal_worker_stable-20210128142934516900000005]
aws_iam_role_policy_attachment.external_pozorbot_worker: Refreshing state... [id=external_composer_stable-20210128142934521000000006]
aws_iam_role_policy_attachment.external_worker_read_keys: Refreshing state... [id=external_worker_stable-20210121142052962300000002]
aws_security_group.external_composer: Refreshing state... [id=sg-006abcb539c009c0c]
aws_iam_role_policy_attachment.external_pozorbot_composer: Refreshing state... [id=external_worker_stable-20210128142934539400000007]
aws_iam_policy.internal_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_cloudwatch_logging_stable]
aws_iam_role_policy_attachment.pozorbot_lambda_sqs: Refreshing state... [id=pozorbot_lambda_role_stable-20210128142934468200000003]
aws_iam_role_policy_attachment.internal_pozorbot_worker: Refreshing state... [id=internal_composer_stable-20210128142934485800000004]
aws_vpc_endpoint.external_vpc_secretsmanager: Refreshing state... [id=vpce-01a0d77a44f22a40b]
aws_vpc_endpoint.internal_vpc_cloudwatch_logs: Refreshing state... [id=vpce-0504fafb159143d31]
aws_vpc_endpoint.external_vpc_cloudwatch_logs: Refreshing state... [id=vpce-05bbb2a36d0766e8d]
aws_vpc_endpoint.internal_vpc_secretsmanager: Refreshing state... [id=vpce-0ca491f03889e64a6]
aws_iam_role_policy_attachment.external_cloudwatch_worker: Refreshing state... [id=external_composer_stable-20210121142053396000000003]
aws_iam_role_policy_attachment.external_cloudwatch_composer: Refreshing state... [id=external_worker_stable-20210121142053428000000004]
aws_iam_user_policy_attachment.imagebuilder_s3: Refreshing state... [id=imagebuilder_worker_stable-20201204205417690700000009]
aws_iam_role_policy_attachment.internal_cloudwatch_worker: Refreshing state... [id=internal_composer_stable-2020120420541781800000000a]
aws_iam_role_policy_attachment.internal_cloudwatch_composer: Refreshing state... [id=internal_worker_stable-2020120420541783040000000b]
aws_ebs_volume.composer_external: Refreshing state... [id=vol-04cdca8908908504f]
aws_network_interface.composer_external: Refreshing state... [id=eni-0f0890d7291842f4e]
aws_network_interface.composer_internal: Refreshing state... [id=eni-0df7102235a986cee]
aws_ebs_volume.composer_internal: Refreshing state... [id=vol-0789bee2463abeaba]
aws_eip.lb: Refreshing state... [id=eipalloc-0db925336463825a2]
aws_instance.composer_external: Refreshing state... [id=i-06756468fd2dbda0e]
aws_instance.composer_internal: Refreshing state... [id=i-09e9fa426e96bb81b]
aws_volume_attachment.composer_internal: Refreshing state... [id=vai-1191377066]
aws_launch_template.worker_internal_x86: Refreshing state... [id=lt-08f0a8a5c9c6547df]
aws_volume_attachment.composer_external: Refreshing state... [id=vai-3319833951]
aws_launch_template.worker_external_x86: Refreshing state... [id=lt-0a0bd62efe297d67e]
aws_spot_fleet_request.workers_internal_x86: Refreshing state... [id=sfr-3f5f659b-f419-494b-a88d-c8558bfd9947]
aws_spot_fleet_request.workers_external_x86: Refreshing state... [id=sfr-d731d94d-446d-470a-bfae-d1ff3ec03522]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_cloudinit_config.external_workers_cloud_init will be read during apply
  # (config refers to values not yet known)
 <= data "template_cloudinit_config" "external_workers_cloud_init"  {
      ~ id            = "1880641973" -> (known after apply)
      ~ rendered      = "H4sIAAAAAAAA/9RZ2XLjuHq+V9W8A+JxamaqQ4mLFstnPHVEidRKSuIq6iTlAkFIpAguJkFtPf0iucltHi+PkKIWt+zuWXOqUuObFoF/w4/v39DdJKY4poxxSPEjiApCgxRmtBYFe+z9DbhJEXswOzzdKUNFEqem2utozl2l/GIsnOVBEj8Crsp+U/mmwjC3RN9UrrJ7QZ4meUBPtJBSiPwIx/RvYBUQHMMIP90FcUCraLW++8xlZDDOVzhjpBglXhCvH0HLDegNwclkive0hkhSeAxK4lWw/qaiBBH+wrhvb2kqlSLHWf5YAYABpQWPACOeKRcrAACQ5/4zLKifZMERe88hPpxoyz8G3OW5z2Q5BJ1OpyMK6hF2uQPipfKz15l3xE6n0+3Mu/vNSh4OSX/VjdsBIoNDZGeSmBkmTyZNGup9g8Npy+vOjjtu4zTt2J+T2UJJ8SwL1L26IP0HZE/bNU1ORY89tuWdevgQrtZ+e1UcVKfeHn5QYHN6MCxx3fDVRN6vtEW/EQwoqulzEruSHIxTPayTIE3q8yUVabTuvKxDvdPsHf3D2m0WDaUd7I3hvm6Lm0JX2P5iflQ3KV4dArv4kA+1Dz5vZvNw3BGLYujM3WxDPsi+FcHJNtsejClf5FO6jR1x47uz3WHa4u3ZBqZjr9b2Dfgyk7idfGiaMh8vUH223rHrYO4288CVjWNLNfDeFhrz9sNLOp/aijNG6XqZER0OBuOlrvj0OG0p3jKbTmRzkehcB3cO9bVPkZpNRYO4DX07awnHI/siajKPutP6lN2ljd3uZeZvd3xMXSE1JjPqYTr6YDXY+SxO48VB1+Nlyh/lHcI85y72zVbst0nsT7LleoNbKJnHs468ryEiNCV9dFgHxQyJuw8h9+AUxFEW5gsUabgbTUJt00s3xoLHDWXENZNeKx8NUL1mN8LDarL1lNzyvReuuxj0LWuaHpO1y7YblhOw2kJO46VW47C17ta0D7Z1oM7KeWCzlTVFXifh+8tVPGocHc1cjEZtZRnCeL8XpJY5DUJppLZzc8Oz7LHZPRzY4Wr4YrgjTmysWitPgEjLJvUeckxPHtY48aDaTZnbtNAy6PSno7HqHhcyawh09bBnMTd/egIR3CTZ3zPs+ZBWURLdvcU79vhGg2ufMN89Y54se0NONaRGuTacidxGJvW0KRtisB8Yzd00bC4e4k1t2cLJTJ1LNYXdjesPjTFI3MKDwRtllV0WUPxcZoRLWKaQ+o+gRqP0HN7PZY543sIsP1mGzlngEfx8MXSqi+Zw0nvuThVlaDw9CAiuHlgWN/gGX3frXH3VWjXcVQNi1hNQm+PRQ5tr8xfu7lSZTXVJu7K3Vg0sND2vXX/gGuwKorrLCk2hiZqe0HbdVhPz+IHzVu+Vd567kmY8TXSWTnSuq5neyAjEnmaNTN1cjuasbGqnPZZ2Q26km5pkSWpvbi8XS1YWdHMkLllimT11rvDOUbXEvhk2OJdfsjhSGkYv5LW+b7q8JnqsptlmOnG5dAQHy40Ryppm7sZzIoseu3zRLEudh2QwN2RLM2XBY/eBwjbSpezliEt76mK5cW1V0Pv+xgi5l/nCm1mS1TQsbYlNTrIMdQH76tRYpKK3S8u9+pu9UF4Y1kjzWCu2Tc02LVnSJJn1IuWgb2TfEvzM6LMNbKXNOauKJksETZaXeki3dkgSL1Kn3ZPNo65pytKS92RTkqUTrd3uld/zUFbnsZjZluzolqo4R39i26lqWiTGsahNTVVUuNFEibyh1hP3zkI+epv12LFGGytUeJUojWXo7zXT3ENzb9nSg6D0RhreWEfIp4kipHtjQAbmxhdM4mwnvDpS7OEebUQLW6nhsHuocEiwrPQw3yWs2tMiR0iOxoLUXVltWpy1NDkxnodkAvueOB3IFJFUV+x25NjaAQ8s3ejSoxsuJd2mdUVAmXOUx0vLKpRIzRXZS7vEYu3eaKBxy55GPNXg5e0y1DJbtnpabE30gTc2ba9vDLSjLqnQttXII56tyylUw3rdY72dQmRoG8OGc/Q5dyG+KFZnbErL3JaU+rIvQ0PifFsmgWaIqr7QbEVSh3osChpLdk5MCtciptulRy22eLenba0+d8CDZIsXfhNJGm+F3AyF8sidp3WXzwVELGoNrFDrW7LJjboG74mKSTnH5HRrYPn6QtTc4yh0heV+fOzstcg5zs36wTJV0WMtcW7LU0vi+trCG5oWkbpkqStSuzsnRNbCRFgaS0cRwt2y386R3h47ZJk6IUk9XitMrpOpIdedSp6oWFaoLzzNNrmuY8p9feMRlayP2BBDl9+Nf4FXvPJqC0+eB23BNJfq3OS6c9upfz2u9q8Yna9TUYtTXuUJ0VnUcOV0gsLhwbA5CCV5r0tEwfbeNwRiIwMJ2pF0DWtkarG6s2OTVQZDQeM0wWG1xIvWnGaqW12Wg260zzxDdFSz7SxZjbcHahf12319MOIVic50e2+onDVWFs5O7edbnZDYHqDM7aemNVC200W6cze+bkV7igbmVmO5mWGYY9MeDcwuncKNBdHRijR2uYBSXTCMIWfa1Jr2RmN34BM9lHNz4Q/n/L5n9q26GaqqY8gNddERrH4jnvbEiU48FlvifDpPWZP31HncEVTL0pf2A6uaZt2U0oMed45wQLaqPKpPrZGm8fSAbVXXF140D30eCr6qR8sC8Ypg621etQmnbXyKJa7Z3aisEyaNMZs2NFPm9EGyd0KPQ6bqjAV5bFqa6XXbmnt0Dl7oLRwzbJjccuIQpe5YvjI/jqZqLG+gPdqjjVlfbjRJD+djPVZzQ38Q0EBtoI28VRca64SjQiUhN18o7W5wzsma2ZCGkiqbRBtpIenNLU0+53J2/L5SDKa68QR3eVnA0iTHWTXJ3SIgXjXJ1u+JO72eJun6E9fiqwJXbdarHHuhsafaWNKedX3yPJYc/bmjqU8wix/hLn/MMcowzSMYwzXOHoucwTCnDPfYFoRWg+farXa7faF6dDO8O/WqTEs2MSYX+bop6l1tODOGU/VZ6aid/qXMddTen1eWF26OsiAtu3rmwsKgJIpg7DHh3CFJ+6rf0Q1JOblL7SjS80yT5OHiKafQJZjBe4qzGBJml2Thpf2+8VtvqD3VMEW1i2+Zq7OvwqWuJhn667kktTebDlXj2dQmTz6laf5Yq709WPX1YFUYwWMSX+6wdtt2fE3lFwtVmkTk693IP8JkE/zH5QMSkuyw9+wlEQziHDyBf4A7imF0i5i7fwN3fuFWy1t8v372zZdb4KoBQfAE7r5uNYIMymg1xWWbdbHuLPAP2/dPs+Odp6MkDmiGvu7Kb4FSboPz6FZksIQcWCUZGEZwjYFYqsEZCGLQsfXqK1cvQfkjuGIgOuk43fPpV81LUFGOoSdx57WqTyNSeRXQ9TEKAd7i7AAEFuQYJbGXAxh7gCRrQBOQH3KSrK8qc0yBB3GUxEBgb9ZK4jPlZ9md0uUAIoTzHGwDWI6cgBZxjMlJMMaA+hhE15PnCcG3espjeSBNMgr4B44vjbrsln9FjgH0vKwUThIEiZ/k9GYfnrV7URA/nlR8NszCWbA6AOpDCnb4uwyDOKEAQxrE65LvbBaOkuwAkvj0FcQ5hTF6ta87kLrjS9iD+zLuX1UHqytvkZd39xNoNf71xrDyVhsAHRDB+c0y9XEM8B4jUCvyrHY6Us0N4lqaHJPMTegzJDi7OYUU50V2dmGWJPT00pAfcoojEOTxdxSsCkLe2isPJ9LF5hPLrGMMQO3W8jyFCL8a/sB+aTgNojd27wLqBzHg/hlHOqPxgo1gBXYYIBiDDEPkA+TF1c/j1OcYUKeG9H3kw4OH4x8egY3BLiAEQLKDhxysMQUQ1FkB+DjDwMUIlshJVgCRAMcUIJzR/K2byusEmY/JM/JiYA+NAbjUtndG3HpuBQOCbwGaBvH6TzjjV0WWsVCvC7dLWUITlJBzErjZyCmkRZnn6qzw7rpAnhOQnMpaDj6Cbqec54bysNsxpBIil4yV+XlUQ7B2Pi9T4LRMbODTnzrUay78zcN/mRz/5UTqwtx/vXQdxx448eQlXq5iqm/z6Xc5wPE2yJK4zIJgC7OgLMg5gBkG1+SIvRM0Hl9Z/3A6/VZSraE2VRVJNa5gnpuSKb2p0C8FLvC7cnzbddSCMtUz7jnVM9cjMTmF689QUiRd7/Slp7v/+a///G9wr0zVofFcztfGKT4vC7qkWcOuVGavy8oJ05BeP3sdQ7o+f2iSbk6Mp/vv4S4H+UsOchx7TITzUxZgmJPhTJERcP96KsBcCRg38Q7g7v5i2N0PF6kY+Qm4P8uuVLIiRpF3fvVAfpR44MP+d2DmTMq2WPZ9EWXAOdchSgCOy1sFDBMnu3M5+ZWX2j/y5rpnch8Tcm4Cf+nR9QadZdVicJGANEhxGb2VPCkyhL/+xFP5FvQxfVNewLBXrQxV3eioXel52Hu6/x6Vjmcm+QmWj7Ua12xX+Ua9evm3RiDFOa1FmELGgxTWrrKYwPuh1NHJcxyV/ikLZAwjXK3I5mTy2qw+3d1//Hr/+om5/3hjzKe7UtwsC2IKkuJseIx3N3JPd36nY3qqpJdidN0u4/T+4xvVn6onkfrFC+8YqpXrr/KSc0yZV1H3b8T8NW774pzzTOGWDnq9dZoAbaCenaHhdZBTnL3FxSltlzSVd0Fzitk3vX9Z8pjzErOFpMDg38t4YXDspUkQ03Mkf/y1qeLTheUiJfBK+t8YsT6Bn8HmBTAZuKvqJz6dZkG8vgM/nR1yO009X2x9vkxT1U2exJUr+69R3v1OYeBncLqkLALM6vcaUPnaxHf57xzAMLCgyV8Jaz2ckuQAynH5VBzOo01+xtlls0TZdXwB3c6pHQpWAYIUVysuzHGzDhgPMODHH38E9x/fPQJ/Aj+B+4+3k+ynmxnol9SE+HCaMN7o+v/C9VeeJn4TymdHnt4h3iL388bd1ynPsHx16pfeOzMwIT6cPPhOMMro/1Hw9Wpu4uKL0/z1IH5qDsrq8BWgl9WlSG9IKt8CY9qbvp0ZYoy9Mg+jJN7irKxHwamz7Kk6KEtsBnZlr7vDgMAiRn61giA9BcXdjacvY8KnW++XVerTHfjpp1sT/kIuvpbzIr34FeQ42wYIX/w7y3Ba9tPvH0O+y0GGo4Ti92yn2M8TFOJy8PqFNu4q7Szi8nL29/dufXxosewXzmSYbyr/GwAA//+CfBlf9R8AAA==" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ part {
          ~ content      = <<-EOT
                #cloud-config
                
                users:
                  - name: ec2-user
                    ssh_authorized_keys:
                      - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                      - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
                
                write_files:
                  - path: /tmp/cloud_init_vars
                    content: |
                      OSBUILD_COMMIT=83caf800e52524b414f7f5bf5ae0d3c912c89192
                      COMPOSER_COMMIT=7f5e36dd948150fac4b03636c6d39bb76e2e81df
                      OSBUILD_CA_CERT=LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUREVENDQWZXZ0F3SUJBZ0lVUDNQM2YzNVBGUk51b2Z0emM5TDk2RGhUb2RBd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0ZqRVVNQklHQTFVRUF3d0xiM05pZFdsc1pDNXZjbWN3SGhjTk1qQXdPVEV6TVRZeU1EVTNXaGNOTXpBdwpPVEV4TVRZeU1EVTNXakFXTVJRd0VnWURWUVFEREF0dmMySjFhV3hrTG05eVp6Q0NBU0l3RFFZSktvWklodmNOCkFRRUJCUUFEZ2dFUEFEQ0NBUW9DZ2dFQkFNQnBrWVFYSVNMYzhLWWpNUVlnenBROUNBM1JLMmdIRDBxYXFzdjgKYVJjVkM2NlM5ZkhxRUUxaUxVWE83MDJRejVza2poM3pxTHlHUjh3UlYvL2NJMWIxcjBVeVpTY0xaM1c3VVpyQwo0NDRmY3ozTXl4bFN6V1VZU1BnQklLaGdBOHFtclpSMW9mYWRyeHVSTCtzbkZESWt4M3crYzFKZVVuMmNsMFdpClV0WDJHR1ZDRldNT2FvZkRrWFVDRnVLSHdKUWdGTHRzSENaWWNmdldWSFpaNk44d0dwMlFaWTI5Yzh1bXBqMVAKUEZsWEM4ZGFaTE1hWFliRTBNSXRWMENISnB3R0lwYnlubVlUbCtzRnV2bDRvVG1yeHoveXh6cER2Vk1PckFJbQp4b2s3clVtVHVkRGVFU1JCT2dBMUt1YU1SVHVhSXBRbzJkb3ZxKzAxRmYzQU4yVUNBd0VBQWFOVE1GRXdIUVlEClZSME9CQllFRko3ZTZYM3kwZG9scS9KYlZpYklpd2RuU1ArNk1COEdBMVVkSXdRWU1CYUFGSjdlNlgzeTBkb2wKcS9KYlZpYklpd2RuU1ArNk1BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQgpBRnp2N2llS0c5bFpLckIyTW1aaEFxSElMeWxhT3lWcTc3RzlCTVJURnNwWnU0MHI3R1R3Y0Rodmg1RUNvSFFiCmxrdTBYNU9YZ0R2WHNCcG9GSHJ2MEtPSWxTN1VKMXYwNGsvSllnWHcrbGpUVHMvOXpwbjhSVmxtcHUvR01PTTUKUWJHUCtOajVaczVmR0ZXaE43TTI1UWtVODJKbHhlSkFsUXhIQ2xDUGV4UkNNYTF5NXA3VG5nODBLSld0eVBQOQp0U2dNQnA3NVVSZW80NUU4UEpySnAzaHlvNFJ4OVJRR2tyeWNSSXdmQkh2a3hNSmZuc2M3WS92NWl1RjhteE16CjN0Yko5K0p5RUF1SHoxYkd1cUNYK3FKUVRUdC9RbzYydkdXYUk5U1ZLYlM4YVhMQzJONnFjaWJxcjU4ZjRESkQKSnNsTS83cHN5cjFvNXR0YkJuNlk1QXM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                      COMPOSER_HOST=aws.composer.osbuild.org
                      COMPOSER_ADDRESS=172.31.64.10
                      WORKER_SSL_KEYS_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:brew_keys-7FUeel
                      SUBSCRIPTION_MANAGER_COMMAND_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:subscription-manager-command-kQYlo9
                      SYSTEM_HOSTNAME_PREFIX=stable-external-worker
                      COMPOSER_DIR=/etc/osbuild-composer
                      SECRETS_MANAGER_ENDPOINT_URL=https://secretsmanager.us-east-1.amazonaws.com/
                  - path: /etc/osbuild-composer/osbuild-composer.toml
                    content: |
                      [koji]
                      allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                      ca = "/etc/osbuild-composer/ca-crt.pem"
                
                      [worker]
                      allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                      ca = "/etc/osbuild-composer/ca-crt.pem"
                  - path: /etc/monitrc
                    content: |
                      # Monit configuration for Image Builder in AWS.
                      # Docs: https://mmonit.com/monit/documentation/monit.html
                
                      # Check every 30 seconds and log to syslog.
                      set daemon 30
                      set log syslog
                
                      # Allow access via ssh tunnel to see the monit console.
                      set httpd port 2812 and
                          use address localhost
                          allow admin:monit
                
                      # Verify that we're not eating all the memory on the instance.
                      CHECK SYSTEM $HOST
                        if memory usage > 75%
                          for 5 cycles
                          then exec /usr/local/bin/pozorbot_alert
                
                      # Ensure the root filesystem isn't full.
                      CHECK FILESYSTEM root PATH /
                        if space usage > 80%
                          for 5 times
                          within 15 cycles
                          then exec /usr/local/bin/pozorbot_alert
                
                      # Check to see if we can reach cdn.redhat.com.
                      # NOTE(mhayden): We will always get a 403 here because of client certs.
                      CHECK HOST rhel_cdn WITH ADDRESS cdn.redhat.com
                        if failed
                          ping
                          then exec /usr/local/bin/pozorbot_alert
                        if failed
                          port 443
                          protocol https
                          status = 403
                          with ssl options { CACERTIFICATEFILE: /etc/rhsm/ca/redhat-uep.pem }
                          then exec /usr/local/bin/pozorbot_alert
                  - path: /usr/local/bin/pozorbot_alert
                    content: |
                      #!/bin/bash
                      # Send alerts to pozorbot.
                      # Monit's environment variables are documented here:
                      # https://mmonit.com/monit/documentation/monit.html#ENVIRONMENT
                
                      QUEUE_URL=https://queue.amazonaws.com/933752197999/image-builder-pozorbot-staging
                      MESSAGE="🚨 $MONIT_EVENT for $MONIT_SERVICE on $MONIT_HOST at $MONIT_DATE"
                      RESULT=$(aws sqs send-message --queue-url $QUEUE_URL --message-body "$MESSAGE")
                      echo $RESULT
                
                runcmd:
                  - chmod +x /usr/local/bin/pozorbot_alert
                  - chmod 0700 /etc/monitrc
                  - systemctl enable --now monit
            EOT -> (known after apply)
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
    }

  # data.template_cloudinit_config.internal_workers_cloud_init will be read during apply
  # (config refers to values not yet known)
 <= data "template_cloudinit_config" "internal_workers_cloud_init"  {
      ~ id            = "2916969681" -> (known after apply)
      ~ rendered      = "H4sIAAAAAAAA/9RZ2XLjuHq+V9W8A+JxamaqQ4mLFstnPHVEidRKSuIq6iTlAkFIpAguJkFtPf0iucltHi+PkKIWt+zuWXOqUuObFoF/w4/v39DdJKY4poxxSPEjiApCgxRmtBYFe+z9DbhJEXswOzzdKUNFEqem2utozl2l/GIsnOVBEj8Crsp+U/mmwjC3RN9UrrJ7QZ4meUBPtJBSiPwIx/RvYBUQHMMIP90FcUCraLW++8xlZDDOVzhjpBglXhCvH0HLDegNwclkive0hkhSeAxK4lWw/qaiBBH+wrhvb2kqlSLHWf5YAYABpQWPACOeKRcrAACQ5/4zLKifZMERe88hPpxoyz8G3OW5z2Q5BJ1OpyMK6hF2uQPipfKz15l3xE6n0+3Mu/vNSh4OSX/VjdsBIoNDZGeSmBkmTyZNGup9g8Npy+vOjjtu4zTt2J+T2UJJ8SwL1L26IP0HZE/bNU1ORY89tuWdevgQrtZ+e1UcVKfeHn5QYHN6MCxx3fDVRN6vtEW/EQwoqulzEruSHIxTPayTIE3q8yUVabTuvKxDvdPsHf3D2m0WDaUd7I3hvm6Lm0JX2P5iflQ3KV4dArv4kA+1Dz5vZvNw3BGLYujM3WxDPsi+FcHJNtsejClf5FO6jR1x47uz3WHa4u3ZBqZjr9b2Dfgyk7idfGiaMh8vUH223rHrYO4288CVjWNLNfDeFhrz9sNLOp/aijNG6XqZER0OBuOlrvj0OG0p3jKbTmRzkehcB3cO9bVPkZpNRYO4DX07awnHI/siajKPutP6lN2ljd3uZeZvd3xMXSE1JjPqYTr6YDXY+SxO48VB1+Nlyh/lHcI85y72zVbst0nsT7LleoNbKJnHs468ryEiNCV9dFgHxQyJuw8h9+AUxFEW5gsUabgbTUJt00s3xoLHDWXENZNeKx8NUL1mN8LDarL1lNzyvReuuxj0LWuaHpO1y7YblhOw2kJO46VW47C17ta0D7Z1oM7KeWCzlTVFXifh+8tVPGocHc1cjEZtZRnCeL8XpJY5DUJppLZzc8Oz7LHZPRzY4Wr4YrgjTmysWitPgEjLJvUeckxPHtY48aDaTZnbtNAy6PSno7HqHhcyawh09bBnMTd/egIR3CTZ3zPs+ZBWURLdvcU79vhGg2ufMN89Y54se0NONaRGuTacidxGJvW0KRtisB8Yzd00bC4e4k1t2cLJTJ1LNYXdjesPjTFI3MKDwRtllV0WUPxcZoRLWKaQ+o+gRqP0HN7PZY543sIsP1mGzlngEfx8MXSqi+Zw0nvuThVlaDw9CAiuHlgWN/gGX3frXH3VWjXcVQNi1hNQm+PRQ5tr8xfu7lSZTXVJu7K3Vg0sND2vXX/gGuwKorrLCk2hiZqe0HbdVhPz+IHzVu+Vd567kmY8TXSWTnSuq5neyAjEnmaNTN1cjuasbGqnPZZ2Q26km5pkSWpvbi8XS1YWdHMkLllimT11rvDOUbXEvhk2OJdfsjhSGkYv5LW+b7q8JnqsptlmOnG5dAQHy40Ryppm7sZzIoseu3zRLEudh2QwN2RLM2XBY/eBwjbSpezliEt76mK5cW1V0Pv+xgi5l/nCm1mS1TQsbYlNTrIMdQH76tRYpKK3S8u9+pu9UF4Y1kjzWCu2Tc02LVnSJJn1IuWgb2TfEvzM6LMNbKXNOauKJksETZaXeki3dkgSL1Kn3ZPNo65pytKS92RTkqUTrd3uld/zUFbnsZjZluzolqo4R39i26lqWiTGsahNTVVUuNFEibyh1hP3zkI+epv12LFGGytUeJUojWXo7zXT3ENzb9nSg6D0RhreWEfIp4kipHtjQAbmxhdM4mwnvDpS7OEebUQLW6nhsHuocEiwrPQw3yWs2tMiR0iOxoLUXVltWpy1NDkxnodkAvueOB3IFJFUV+x25NjaAQ8s3ejSoxsuJd2mdUVAmXOUx0vLKpRIzRXZS7vEYu3eaKBxy55GPNXg5e0y1DJbtnpabE30gTc2ba9vDLSjLqnQttXII56tyylUw3rdY72dQmRoG8OGc/Q5dyG+KFZnbErL3JaU+rIvQ0PifFsmgWaIqr7QbEVSh3osChpLdk5MCtciptulRy22eLenba0+d8CDZIsXfhNJGm+F3AyF8sidp3WXzwVELGoNrFDrW7LJjboG74mKSTnH5HRrYPn6QtTc4yh0heV+fOzstcg5zs36wTJV0WMtcW7LU0vi+trCG5oWkbpkqStSuzsnRNbCRFgaS0cRwt2y386R3h47ZJk6IUk9XitMrpOpIdedSp6oWFaoLzzNNrmuY8p9feMRlayP2BBDl9+Nf4FXvPJqC0+eB23BNJfq3OS6c9upfz2u9q8Yna9TUYtTXuUJ0VnUcOV0gsLhwbA5CCV5r0tEwfbeNwRiIwMJ2pF0DWtkarG6s2OTVQZDQeM0wWG1xIvWnGaqW12Wg260zzxDdFSz7SxZjbcHahf12319MOIVic50e2+onDVWFs5O7edbnZDYHqDM7aemNVC200W6cze+bkV7igbmVmO5mWGYY9MeDcwuncKNBdHRijR2uYBSXTCMIWfa1Jr2RmN34BM9lHNz4Q/n/L5n9q26GaqqY8gNddERrH4jnvbEiU48FlvifDpPWZP31HncEVTL0pf2A6uaZt2U0oMed45wQLaqPKpPrZGm8fSAbVXXF140D30eCr6qR8sC8Ypg621etQmnbXyKJa7Z3aisEyaNMZs2NFPm9EGyd0KPQ6bqjAV5bFqa6XXbmnt0Dl7oLRwzbJjccuIQpe5YvjI/jqZqLG+gPdqjjVlfbjRJD+djPVZzQ38Q0EBtoI28VRca64SjQiUhN18o7W5wzsma2ZCGkiqbRBtpIenNLU0+53J2/L5SDKa68QR3eVnA0iTHWTXJ3SIgXjXJ1u+JO72eJun6E8dWBbbKPVQ59kJiT7WxpD3r+uR5LDn6c0dTn2AWP8Jd/phjlGGaRzCGa5w9FjmDYU4Z7rEtCK0Gz7Vb7Xb7QvXoZnh3alWZlmxiTC7ydVPUu9pwZgyn6rPSUTv9S5XrqL0/rywv3BxlQVo29cyFhUFJFMHYY8K5Q5L2Vb+jG5Jy8pbaUaTnmSbJw8VTTqFLMBPEFGcxJMwuycJL933jtt5Qe6phimoX1zJXX1+FS11NMvTXc0lqbzYdqsazqU2efErT/LFW26YIMyyC9Ta3YoWHhzZu1mGTaVG25W6bSfXtwauvB6+WjFUYwWMSX+65dtuafM2uLxaqNInI1zuWf4TJJviPywckJNlh79lLIhjEOXgC/wB3FMPoFlV3/wbu/MKtllf9fv3swC+3wFUDguAJ3H3dagQZlNFqistW7GLdWeAftu+fZsc7T0dJHNAMfd2V3wKl3Abn8a7IYIlLsEoyMIzgGgOxVIMzEMSgY+vVV65egvJHcAVKdNJxuufTr5qXoKIcVU/izmtVn0ak8iqg62MUArzF2QEILMgxSmIvBzD2AEnWgCYgP+QkWV9V5pgCD+IoiYHA3qyVxGfKz7I7pcsBRAjnOdgGsBxLAS3iGJOTYIwB9TGIrifPE4Jv9ZTH8kCaZBTwDxxfGnXZLf+KHAPoeVkpnCQIEj/J6c0+PGv3oiB+PKn4bJiFs2B1ANSHFOzwdxkGcUIBhjSI1yXf2SwcJdkBJPHpK4hzCmP0al93IHXHl9wA7svk8Ko6WF15i7y8u59Aq/GvN4aVt9oA6IAIzm+WqY9jgPcYgVqRZ7XTkWpuENfS5JhkbkKfIcHZzSmkOC+yswuzJKGn14j8kFMcgSCPv6NgVRDy1l55OJEuNp9YZh1jAGq3lucpRPjV8Af2S8NpEL2xexdQP4gB98840hmNF2wEK7DDAMEYZBgiHyAvrn4euT7HgDo1pO8jHx48HP/wCGwMdgEhAJIdPORgjSmAoM4KwMcZBi5GsEROsgKIBDimAOGM5m/dVF4nyHxMnpEXA3toDMCl/r0z4tZzKxgQfAvQNIjXf8IZvyqyjIV6XbhdyhKaoISck8DNRk4hLco8V2eFd9cF8pyA5FT7cvARdDvlzDeUh92OIZUQuWSszM+jGoK183mZAqdlYgOf/tShXnPhbx7+y+T4LydSF+b+66XrOPbAiScv8XIVU32bT7/LAY63QZbEZRYEW5gFZdXOAcwwuCZH7J2g8fjK+ofT6beSag21qapIqnEF89yUTOlNGX8pcPG+HN+2JrWgTPWMe071zPVITE7h+jOUFEnXO33p6e5//us//xvcK1N1aDyXM7hxis/Lgi5p1rArldnrsnLCNKTXz17HkK5PJJqkmxPj6f57uMtB/pKDHMceE+H8lAUY5mQ4U2QE3L+eCjBXAsZNvAO4u78YdvfDRSpGfgLuz7IrlayIUeSdX0aQHyUe+LD/HZg5k7Itln1fRBlwznWIEoDj8lYBw8TJ7lxOfuU194+8y+6Z3MeEnDvFX3qYvUFnWbUYXCQgDVJcRm8lT4oM4a8/A1W+BX1M35QXMOxVK0NVNzpqV3oe9p7uv0el45lJfoLlY63GNdtVvlGvXv6tEUhxTmsRppDxIIW1qywm8H4odXTyHEelf8oCGcMIVyuyOZm8drRPd/cfv97kfmLuP94Y8+muFDfLgpiCpDgbHuPdjdzTnd/pmJ4q6aUYXbfLOL3/+Eb1p+pJpH7xwjuGauX6q7zkHFPmVdT9GzF/jdu+OOc8eLilg15vnSZAG6hnZ2h4HeQUZ29xcUrbJU3lXdCcYvbNAFCWPOa8xGwhKTD49zJeGBx7aRLE9BzJH39t9Ph0YblICbyS/jfmsE/gZ7B5AUwG7qr6iU+nWRCv78BPZ4fcjlzPF1ufLyNXdZMnceXK/muUd79TGPgZnC4piwCz+r0GVL42Fl7+ywcwDCxo8lfCWg+nJDmAcqY+FYfzaJOfcXbZLFF2HV9At3Nqh4JVgCDF1YoLc9ysA8YDDPjxxx/B/cd3D8WfwE/g/uPtuPvpZgb6JTUhPpwmjDe6/r9w/ZX3i9+E8tmRp8eKt8j9vHH3dcozLF+d+qX3zgxMiA8nD74TjDL6fxR8vZqbuPjiNH89iJ+ag7I6fAXoZXUp0huSyrfAmPamb2eGGGOvzMMoibc4K+tRcOose6oOyhKbgV3Z6+4wILCIkV+tIEhPQXF34+nLmPDp1vtllfp0B3766daEv5CLr+W8SC9+BTnOtgHCF//OMpyW/fT7x5DvcpDhKKH4Pdsp9vMEhbgcvH6hjbtKO4u4PK/9/b1bHx9aLPuFMxnmm8r/BgAA///QkqUSGSAAAA==" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ part {
          ~ content      = <<-EOT
                #cloud-config
                
                users:
                  - name: ec2-user
                    ssh_authorized_keys:
                      - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                      - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
                
                write_files:
                  - path: /tmp/cloud_init_vars
                    content: |
                      OSBUILD_COMMIT=83caf800e52524b414f7f5bf5ae0d3c912c89192
                      COMPOSER_COMMIT=7f5e36dd948150fac4b03636c6d39bb76e2e81df
                      OSBUILD_CA_CERT=LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUREVENDQWZXZ0F3SUJBZ0lVUDNQM2YzNVBGUk51b2Z0emM5TDk2RGhUb2RBd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0ZqRVVNQklHQTFVRUF3d0xiM05pZFdsc1pDNXZjbWN3SGhjTk1qQXdPVEV6TVRZeU1EVTNXaGNOTXpBdwpPVEV4TVRZeU1EVTNXakFXTVJRd0VnWURWUVFEREF0dmMySjFhV3hrTG05eVp6Q0NBU0l3RFFZSktvWklodmNOCkFRRUJCUUFEZ2dFUEFEQ0NBUW9DZ2dFQkFNQnBrWVFYSVNMYzhLWWpNUVlnenBROUNBM1JLMmdIRDBxYXFzdjgKYVJjVkM2NlM5ZkhxRUUxaUxVWE83MDJRejVza2poM3pxTHlHUjh3UlYvL2NJMWIxcjBVeVpTY0xaM1c3VVpyQwo0NDRmY3ozTXl4bFN6V1VZU1BnQklLaGdBOHFtclpSMW9mYWRyeHVSTCtzbkZESWt4M3crYzFKZVVuMmNsMFdpClV0WDJHR1ZDRldNT2FvZkRrWFVDRnVLSHdKUWdGTHRzSENaWWNmdldWSFpaNk44d0dwMlFaWTI5Yzh1bXBqMVAKUEZsWEM4ZGFaTE1hWFliRTBNSXRWMENISnB3R0lwYnlubVlUbCtzRnV2bDRvVG1yeHoveXh6cER2Vk1PckFJbQp4b2s3clVtVHVkRGVFU1JCT2dBMUt1YU1SVHVhSXBRbzJkb3ZxKzAxRmYzQU4yVUNBd0VBQWFOVE1GRXdIUVlEClZSME9CQllFRko3ZTZYM3kwZG9scS9KYlZpYklpd2RuU1ArNk1COEdBMVVkSXdRWU1CYUFGSjdlNlgzeTBkb2wKcS9KYlZpYklpd2RuU1ArNk1BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQgpBRnp2N2llS0c5bFpLckIyTW1aaEFxSElMeWxhT3lWcTc3RzlCTVJURnNwWnU0MHI3R1R3Y0Rodmg1RUNvSFFiCmxrdTBYNU9YZ0R2WHNCcG9GSHJ2MEtPSWxTN1VKMXYwNGsvSllnWHcrbGpUVHMvOXpwbjhSVmxtcHUvR01PTTUKUWJHUCtOajVaczVmR0ZXaE43TTI1UWtVODJKbHhlSkFsUXhIQ2xDUGV4UkNNYTF5NXA3VG5nODBLSld0eVBQOQp0U2dNQnA3NVVSZW80NUU4UEpySnAzaHlvNFJ4OVJRR2tyeWNSSXdmQkh2a3hNSmZuc2M3WS92NWl1RjhteE16CjN0Yko5K0p5RUF1SHoxYkd1cUNYK3FKUVRUdC9RbzYydkdXYUk5U1ZLYlM4YVhMQzJONnFjaWJxcjU4ZjRESkQKSnNsTS83cHN5cjFvNXR0YkJuNlk1QXM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                      COMPOSER_HOST=aws.composer.osbuild.org
                      COMPOSER_ADDRESS=10.30.18.10
                      WORKER_SSL_KEYS_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:brew_keys-7FUeel
                      SUBSCRIPTION_MANAGER_COMMAND_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:subscription-manager-command-kQYlo9
                      SYSTEM_HOSTNAME_PREFIX=stable-internal-worker
                      COMPOSER_DIR=/etc/osbuild-composer
                      SECRETS_MANAGER_ENDPOINT_URL=https://vpce-0ca491f03889e64a6-7t07bv6o.secretsmanager.us-east-1.vpce.amazonaws.com/
                  - path: /etc/osbuild-composer/osbuild-composer.toml
                    content: |
                      [koji]
                      allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                      ca = "/etc/osbuild-composer/ca-crt.pem"
                
                      [worker]
                      allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                      ca = "/etc/osbuild-composer/ca-crt.pem"
                  - path: /etc/monitrc
                    content: |
                      # Monit configuration for Image Builder in AWS.
                      # Docs: https://mmonit.com/monit/documentation/monit.html
                
                      # Check every 30 seconds and log to syslog.
                      set daemon 30
                      set log syslog
                
                      # Allow access via ssh tunnel to see the monit console.
                      set httpd port 2812 and
                          use address localhost
                          allow admin:monit
                
                      # Verify that we're not eating all the memory on the instance.
                      CHECK SYSTEM $HOST
                        if memory usage > 75%
                          for 5 cycles
                          then exec /usr/local/bin/pozorbot_alert
                
                      # Ensure the root filesystem isn't full.
                      CHECK FILESYSTEM root PATH /
                        if space usage > 80%
                          for 5 times
                          within 15 cycles
                          then exec /usr/local/bin/pozorbot_alert
                
                      # Check to see if we can reach cdn.redhat.com.
                      # NOTE(mhayden): We will always get a 403 here because of client certs.
                      CHECK HOST rhel_cdn WITH ADDRESS cdn.redhat.com
                        if failed
                          ping
                          then exec /usr/local/bin/pozorbot_alert
                        if failed
                          port 443
                          protocol https
                          status = 403
                          with ssl options { CACERTIFICATEFILE: /etc/rhsm/ca/redhat-uep.pem }
                          then exec /usr/local/bin/pozorbot_alert
                  - path: /usr/local/bin/pozorbot_alert
                    content: |
                      #!/bin/bash
                      # Send alerts to pozorbot.
                      # Monit's environment variables are documented here:
                      # https://mmonit.com/monit/documentation/monit.html#ENVIRONMENT
                
                      QUEUE_URL=https://queue.amazonaws.com/933752197999/image-builder-pozorbot-staging
                      MESSAGE="🚨 $MONIT_EVENT for $MONIT_SERVICE on $MONIT_HOST at $MONIT_DATE"
                      RESULT=$(aws sqs send-message --queue-url $QUEUE_URL --message-body "$MESSAGE")
                      echo $RESULT
                
                runcmd:
                  - chmod +x /usr/local/bin/pozorbot_alert
                  - chmod 0700 /etc/monitrc
                  - systemctl enable --now monit
            EOT -> (known after apply)
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
    }

  # data.template_file.external_workers_cloud_config will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "external_workers_cloud_config"  {
      ~ id       = "b807b69a9ce42f9a548b0e180f23ca934e709420f0fac50a6867deb3a741eca7" -> (known after apply)
      ~ rendered = <<-EOT
            #cloud-config
            
            users:
              - name: ec2-user
                ssh_authorized_keys:
                  - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                  - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
            
            write_files:
              - path: /tmp/cloud_init_vars
                content: |
                  OSBUILD_COMMIT=83caf800e52524b414f7f5bf5ae0d3c912c89192
                  COMPOSER_COMMIT=7f5e36dd948150fac4b03636c6d39bb76e2e81df
                  OSBUILD_CA_CERT=LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUREVENDQWZXZ0F3SUJBZ0lVUDNQM2YzNVBGUk51b2Z0emM5TDk2RGhUb2RBd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0ZqRVVNQklHQTFVRUF3d0xiM05pZFdsc1pDNXZjbWN3SGhjTk1qQXdPVEV6TVRZeU1EVTNXaGNOTXpBdwpPVEV4TVRZeU1EVTNXakFXTVJRd0VnWURWUVFEREF0dmMySjFhV3hrTG05eVp6Q0NBU0l3RFFZSktvWklodmNOCkFRRUJCUUFEZ2dFUEFEQ0NBUW9DZ2dFQkFNQnBrWVFYSVNMYzhLWWpNUVlnenBROUNBM1JLMmdIRDBxYXFzdjgKYVJjVkM2NlM5ZkhxRUUxaUxVWE83MDJRejVza2poM3pxTHlHUjh3UlYvL2NJMWIxcjBVeVpTY0xaM1c3VVpyQwo0NDRmY3ozTXl4bFN6V1VZU1BnQklLaGdBOHFtclpSMW9mYWRyeHVSTCtzbkZESWt4M3crYzFKZVVuMmNsMFdpClV0WDJHR1ZDRldNT2FvZkRrWFVDRnVLSHdKUWdGTHRzSENaWWNmdldWSFpaNk44d0dwMlFaWTI5Yzh1bXBqMVAKUEZsWEM4ZGFaTE1hWFliRTBNSXRWMENISnB3R0lwYnlubVlUbCtzRnV2bDRvVG1yeHoveXh6cER2Vk1PckFJbQp4b2s3clVtVHVkRGVFU1JCT2dBMUt1YU1SVHVhSXBRbzJkb3ZxKzAxRmYzQU4yVUNBd0VBQWFOVE1GRXdIUVlEClZSME9CQllFRko3ZTZYM3kwZG9scS9KYlZpYklpd2RuU1ArNk1COEdBMVVkSXdRWU1CYUFGSjdlNlgzeTBkb2wKcS9KYlZpYklpd2RuU1ArNk1BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQgpBRnp2N2llS0c5bFpLckIyTW1aaEFxSElMeWxhT3lWcTc3RzlCTVJURnNwWnU0MHI3R1R3Y0Rodmg1RUNvSFFiCmxrdTBYNU9YZ0R2WHNCcG9GSHJ2MEtPSWxTN1VKMXYwNGsvSllnWHcrbGpUVHMvOXpwbjhSVmxtcHUvR01PTTUKUWJHUCtOajVaczVmR0ZXaE43TTI1UWtVODJKbHhlSkFsUXhIQ2xDUGV4UkNNYTF5NXA3VG5nODBLSld0eVBQOQp0U2dNQnA3NVVSZW80NUU4UEpySnAzaHlvNFJ4OVJRR2tyeWNSSXdmQkh2a3hNSmZuc2M3WS92NWl1RjhteE16CjN0Yko5K0p5RUF1SHoxYkd1cUNYK3FKUVRUdC9RbzYydkdXYUk5U1ZLYlM4YVhMQzJONnFjaWJxcjU4ZjRESkQKSnNsTS83cHN5cjFvNXR0YkJuNlk1QXM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                  COMPOSER_HOST=aws.composer.osbuild.org
                  COMPOSER_ADDRESS=172.31.64.10
                  WORKER_SSL_KEYS_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:brew_keys-7FUeel
                  SUBSCRIPTION_MANAGER_COMMAND_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:subscription-manager-command-kQYlo9
                  SYSTEM_HOSTNAME_PREFIX=stable-external-worker
                  COMPOSER_DIR=/etc/osbuild-composer
                  SECRETS_MANAGER_ENDPOINT_URL=https://secretsmanager.us-east-1.amazonaws.com/
              - path: /etc/osbuild-composer/osbuild-composer.toml
                content: |
                  [koji]
                  allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
            
                  [worker]
                  allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
              - path: /etc/monitrc
                content: |
                  # Monit configuration for Image Builder in AWS.
                  # Docs: https://mmonit.com/monit/documentation/monit.html
            
                  # Check every 30 seconds and log to syslog.
                  set daemon 30
                  set log syslog
            
                  # Allow access via ssh tunnel to see the monit console.
                  set httpd port 2812 and
                      use address localhost
                      allow admin:monit
            
                  # Verify that we're not eating all the memory on the instance.
                  CHECK SYSTEM $HOST
                    if memory usage > 75%
                      for 5 cycles
                      then exec /usr/local/bin/pozorbot_alert
            
                  # Ensure the root filesystem isn't full.
                  CHECK FILESYSTEM root PATH /
                    if space usage > 80%
                      for 5 times
                      within 15 cycles
                      then exec /usr/local/bin/pozorbot_alert
            
                  # Check to see if we can reach cdn.redhat.com.
                  # NOTE(mhayden): We will always get a 403 here because of client certs.
                  CHECK HOST rhel_cdn WITH ADDRESS cdn.redhat.com
                    if failed
                      ping
                      then exec /usr/local/bin/pozorbot_alert
                    if failed
                      port 443
                      protocol https
                      status = 403
                      with ssl options { CACERTIFICATEFILE: /etc/rhsm/ca/redhat-uep.pem }
                      then exec /usr/local/bin/pozorbot_alert
              - path: /usr/local/bin/pozorbot_alert
                content: |
                  #!/bin/bash
                  # Send alerts to pozorbot.
                  # Monit's environment variables are documented here:
                  # https://mmonit.com/monit/documentation/monit.html#ENVIRONMENT
            
                  QUEUE_URL=https://queue.amazonaws.com/933752197999/image-builder-pozorbot-staging
                  MESSAGE="🚨 $MONIT_EVENT for $MONIT_SERVICE on $MONIT_HOST at $MONIT_DATE"
                  RESULT=$(aws sqs send-message --queue-url $QUEUE_URL --message-body "$MESSAGE")
                  echo $RESULT
            
            runcmd:
              - chmod +x /usr/local/bin/pozorbot_alert
              - chmod 0700 /etc/monitrc
              - systemctl enable --now monit
        EOT -> (known after apply)
      ~ vars     = {
          ~ "composer_address"                = "172.31.64.10" -> (known after apply)
            # (8 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # data.template_file.internal_workers_cloud_config will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "internal_workers_cloud_config"  {
      ~ id       = "e617d65c7f7f0ab7d6020c72e6616618404f6164ae511e1334c763b623463496" -> (known after apply)
      ~ rendered = <<-EOT
            #cloud-config
            
            users:
              - name: ec2-user
                ssh_authorized_keys:
                  - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                  - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
            
            write_files:
              - path: /tmp/cloud_init_vars
                content: |
                  OSBUILD_COMMIT=83caf800e52524b414f7f5bf5ae0d3c912c89192
                  COMPOSER_COMMIT=7f5e36dd948150fac4b03636c6d39bb76e2e81df
                  OSBUILD_CA_CERT=LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUREVENDQWZXZ0F3SUJBZ0lVUDNQM2YzNVBGUk51b2Z0emM5TDk2RGhUb2RBd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0ZqRVVNQklHQTFVRUF3d0xiM05pZFdsc1pDNXZjbWN3SGhjTk1qQXdPVEV6TVRZeU1EVTNXaGNOTXpBdwpPVEV4TVRZeU1EVTNXakFXTVJRd0VnWURWUVFEREF0dmMySjFhV3hrTG05eVp6Q0NBU0l3RFFZSktvWklodmNOCkFRRUJCUUFEZ2dFUEFEQ0NBUW9DZ2dFQkFNQnBrWVFYSVNMYzhLWWpNUVlnenBROUNBM1JLMmdIRDBxYXFzdjgKYVJjVkM2NlM5ZkhxRUUxaUxVWE83MDJRejVza2poM3pxTHlHUjh3UlYvL2NJMWIxcjBVeVpTY0xaM1c3VVpyQwo0NDRmY3ozTXl4bFN6V1VZU1BnQklLaGdBOHFtclpSMW9mYWRyeHVSTCtzbkZESWt4M3crYzFKZVVuMmNsMFdpClV0WDJHR1ZDRldNT2FvZkRrWFVDRnVLSHdKUWdGTHRzSENaWWNmdldWSFpaNk44d0dwMlFaWTI5Yzh1bXBqMVAKUEZsWEM4ZGFaTE1hWFliRTBNSXRWMENISnB3R0lwYnlubVlUbCtzRnV2bDRvVG1yeHoveXh6cER2Vk1PckFJbQp4b2s3clVtVHVkRGVFU1JCT2dBMUt1YU1SVHVhSXBRbzJkb3ZxKzAxRmYzQU4yVUNBd0VBQWFOVE1GRXdIUVlEClZSME9CQllFRko3ZTZYM3kwZG9scS9KYlZpYklpd2RuU1ArNk1COEdBMVVkSXdRWU1CYUFGSjdlNlgzeTBkb2wKcS9KYlZpYklpd2RuU1ArNk1BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQgpBRnp2N2llS0c5bFpLckIyTW1aaEFxSElMeWxhT3lWcTc3RzlCTVJURnNwWnU0MHI3R1R3Y0Rodmg1RUNvSFFiCmxrdTBYNU9YZ0R2WHNCcG9GSHJ2MEtPSWxTN1VKMXYwNGsvSllnWHcrbGpUVHMvOXpwbjhSVmxtcHUvR01PTTUKUWJHUCtOajVaczVmR0ZXaE43TTI1UWtVODJKbHhlSkFsUXhIQ2xDUGV4UkNNYTF5NXA3VG5nODBLSld0eVBQOQp0U2dNQnA3NVVSZW80NUU4UEpySnAzaHlvNFJ4OVJRR2tyeWNSSXdmQkh2a3hNSmZuc2M3WS92NWl1RjhteE16CjN0Yko5K0p5RUF1SHoxYkd1cUNYK3FKUVRUdC9RbzYydkdXYUk5U1ZLYlM4YVhMQzJONnFjaWJxcjU4ZjRESkQKSnNsTS83cHN5cjFvNXR0YkJuNlk1QXM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                  COMPOSER_HOST=aws.composer.osbuild.org
                  COMPOSER_ADDRESS=10.30.18.10
                  WORKER_SSL_KEYS_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:brew_keys-7FUeel
                  SUBSCRIPTION_MANAGER_COMMAND_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:subscription-manager-command-kQYlo9
                  SYSTEM_HOSTNAME_PREFIX=stable-internal-worker
                  COMPOSER_DIR=/etc/osbuild-composer
                  SECRETS_MANAGER_ENDPOINT_URL=https://vpce-0ca491f03889e64a6-7t07bv6o.secretsmanager.us-east-1.vpce.amazonaws.com/
              - path: /etc/osbuild-composer/osbuild-composer.toml
                content: |
                  [koji]
                  allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
            
                  [worker]
                  allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
              - path: /etc/monitrc
                content: |
                  # Monit configuration for Image Builder in AWS.
                  # Docs: https://mmonit.com/monit/documentation/monit.html
            
                  # Check every 30 seconds and log to syslog.
                  set daemon 30
                  set log syslog
            
                  # Allow access via ssh tunnel to see the monit console.
                  set httpd port 2812 and
                      use address localhost
                      allow admin:monit
            
                  # Verify that we're not eating all the memory on the instance.
                  CHECK SYSTEM $HOST
                    if memory usage > 75%
                      for 5 cycles
                      then exec /usr/local/bin/pozorbot_alert
            
                  # Ensure the root filesystem isn't full.
                  CHECK FILESYSTEM root PATH /
                    if space usage > 80%
                      for 5 times
                      within 15 cycles
                      then exec /usr/local/bin/pozorbot_alert
            
                  # Check to see if we can reach cdn.redhat.com.
                  # NOTE(mhayden): We will always get a 403 here because of client certs.
                  CHECK HOST rhel_cdn WITH ADDRESS cdn.redhat.com
                    if failed
                      ping
                      then exec /usr/local/bin/pozorbot_alert
                    if failed
                      port 443
                      protocol https
                      status = 403
                      with ssl options { CACERTIFICATEFILE: /etc/rhsm/ca/redhat-uep.pem }
                      then exec /usr/local/bin/pozorbot_alert
              - path: /usr/local/bin/pozorbot_alert
                content: |
                  #!/bin/bash
                  # Send alerts to pozorbot.
                  # Monit's environment variables are documented here:
                  # https://mmonit.com/monit/documentation/monit.html#ENVIRONMENT
            
                  QUEUE_URL=https://queue.amazonaws.com/933752197999/image-builder-pozorbot-staging
                  MESSAGE="🚨 $MONIT_EVENT for $MONIT_SERVICE on $MONIT_HOST at $MONIT_DATE"
                  RESULT=$(aws sqs send-message --queue-url $QUEUE_URL --message-body "$MESSAGE")
                  echo $RESULT
            
            runcmd:
              - chmod +x /usr/local/bin/pozorbot_alert
              - chmod 0700 /etc/monitrc
              - systemctl enable --now monit
        EOT -> (known after apply)
      ~ vars     = {
          ~ "composer_address"                = "10.30.18.10" -> (known after apply)
            # (8 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # aws_instance.composer_external must be replaced
-/+ resource "aws_instance" "composer_external" {
      ~ arn                          = "arn:aws:ec2:us-east-1:933752197999:instance/i-06756468fd2dbda0e" -> (known after apply)
      ~ associate_public_ip_address  = true -> (known after apply)
      ~ availability_zone            = "us-east-1f" -> (known after apply)
      ~ cpu_core_count               = 1 -> (known after apply)
      ~ cpu_threads_per_core         = 2 -> (known after apply)
      - disable_api_termination      = false -> null
      - ebs_optimized                = false -> null
      - hibernation                  = false -> null
      + host_id                      = (known after apply)
      ~ id                           = "i-06756468fd2dbda0e" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
      ~ ipv6_address_count           = 0 -> (known after apply)
      ~ ipv6_addresses               = [] -> (known after apply)
      + key_name                     = (known after apply)
      - monitoring                   = false -> null
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-0f0890d7291842f4e" -> (known after apply)
      ~ private_dns                  = "ip-172-31-64-10.ec2.internal" -> (known after apply)
      ~ private_ip                   = "172.31.64.10" -> (known after apply)
      ~ public_dns                   = "ec2-35-169-38-119.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                    = "35.169.38.119" -> (known after apply)
      ~ secondary_private_ips        = [] -> (known after apply)
      ~ security_groups              = [
          - "external_composer_stable",
        ] -> (known after apply)
      - source_dest_check            = true -> null
      ~ subnet_id                    = "subnet-0c016a02" -> (known after apply)
        tags                         = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🏗 External Composer (stable)"
            "ServiceOwner" = "Image Builder"
        }
      ~ tenancy                      = "default" -> (known after apply)
      ~ user_data_base64             = "H4sIAAAAAAAA/9R76W7jyr3ndwN5B94+PUiCc2VzkdStTjq4okhqZZW5FUVmLgwuJXEpLk1SC3lyXmS+zNd5vHmEQVGy23Z3+yTBBSbXgGCzln/9l99/K9GzIm9w3gzMtsSfmOxAmrj0quYui884/BPjF4c89Kr28zt1qcoitIA01Z13N/RpgHBVx0X+ieFu2d/d/O5mMHi+6Hc3j7SluC6LOm76tV7TeEGU4bz5E7OLCc69DH9+F+dxcxvs9u++7jIrL693uBrIeVCEcb7/xHzw4+bZgp7lBp+bu4AUh3AQFPku3v/uRo0z/A1zPz1fc3NzqHFVf7phmAFDOfjE4IAf0MEbhmGYuo4evEMTFVXc4fAhxW2/lv4MmHd1HQ2q2mOm0+lUFEDnzbg24GX6KE21qTidTmdTbXZOdspySea7WT6JA7JoM7uSxcq0eLIZN6kxNzlcfghn992JS5yxnUcaud+qJb6vYnAGWzL/GNhwcqcrpRiy3UQ5gfbndLePJrtDC5zhZPmz6o1hayJxP4pAoZx3+nY+ihdNcGdoJPdlJV6XRjokcVkMNbcRm2w//bJPjelY6qJ2748PI3USn83leWiLycFQ2flW60BS4l0b24ef66X+c8RblZaup+LhsHQ0v0rIz0qEMm9zrI6tCflDDZtj7ohJ5N+fWviBt+8Tr1yHd5PI9L7cy9xJaceWwufbYHi/P7H7WPPHdewrZvcBmPhsCyNt8vFLqUFbddZBuXcrYniLxdo11Kjp4Ac1dCu4UaxtYXBTPG2H+6gJQAVFk/gj43j/Qeg69ouoK3wwg0PInsrR6fTlPjqe+LzxhdLc3DchblY/oxGr3edlvm0NI3dLvlNOAeY5f3sef8ijCcmjTeXuE/whKLT8fqqc7wIijGVj1e7jw30gnn5OuY/OgTjq1vriiU16Wm1SPZHKxNzyeKSuuHEhfahXi2B4Z4/Sdrc5hmqNovALN9su5gjBsiv2PjsZISdm9a1S5q5+x2G0n93pP9uobZyd85GtdggG4bTg5+4uX406R7e2q9VEdVMvP58F+YMF41RegUltJTzLduNZ27LL3fKL6a84cbT7sAsFL9CrzVAKHCtUlnec2AJ7rHDJh8CNp3O4WgO/2yqsKTS7j2cWc9rnz0zmJUX1HxUOI6+5DYrs3Uu845AfjbhJj/nZBfPElZYcMOURHVvei1yikGE5VkwxPi/M8Qmm4+3HPLlzP+DiHmjyncqe1sOPozVT+IfQi18cdnOq4gY/0IhwdcvSa6JPzF2TlRf3fqAx4uHoVXXPWXCJAp+Yv10ZhYZoLTfSwwyq6tL8/FEIvN1HlsUjfsQP/SE33H3YjfzdyMNsKAQTjg8+TrgJf909g+o9NGT9cfuH3QgL4zCcDD9yI3bnBUOfFcbCOBiHwsT3P4wxjz9y4e714dOHmaybnzcG22wMbqZb4cqMRUlHK8uw3JXGKpbez7HNLOVWhqXLSAaSZrtbl1UEw1qJLkuQJQFN5Z0OIHFupSPO510WZ+rIlFJen0eWz+tiyOq6bZUbnytX3sJNzFTRdeu01ogihqz7RUcIaClZaKaCdEsRQvYcq+yodJWwDrhSAls38W0gGPMoMVPui7YN75GMxibSXWxxMjLB1psDaG5LMTyVdG74Yi5VtiZa6SGLctvSbQspsi4rbJiprZEoERKiypyzI4zKscYC0WKJoCuKa6TN0U5JEWYAznqeVzPLUmSXDxVLVuR+rT2R6LOWKkDLxcpGimMgoDpdtLHtEliI5DgXdWgBUeVWGzULl7oknp2t0oXJfu2gVYJSlQdEHblpdNYt6+xZZ2TLHwVVWuk4QZ3Hl4UqlGdzQRZWEgkWcY4bHqxUe3kOEhFhVJoOe/ZULhAQKlvtVLBA0jNHKDpzS4a+AsaIQ67FibmWko03D0W4UJqAlIZqTzLH1lu8QIY5azo/dWXDboaqEFROp6xdhA5qBmpVCcsZQawtrRY650o6CYHJK0c31StbQZKeo42xCNeWHc7Nhd4ZMvBsG2QhCW1DKT2QDochG55Uoni2uRw5XcT5W/GLiqZrS3ZrW1aH7lzxTJmLbIXEuikCY6vbqgyWRi4KOktOTk4OPiKWP2s6PUe8L+lHNOdavCiOeBuNA1nnUcrdB6my8rVy6PO1EBDUoAVK9TlSLG41M/lQVK2GcyzOQAsUGVtR97tV6gvued1Nz3rmdJo1bJEFxJBFomYrEMncXN+GSwsReUZcQ5UnM40QRU8LwTVdRxXSkzuf1IExWTvELZ2UlCGvHyxuWoGUm0E5FFWEUmMb6rbFzRxLmRtJSADZd9gUU58/rX+wV3zcq29DRYsngmW5QLO4mWY7w+/71fkJo9q+FPW85AFPiMEGI18pN0G6bE2b8zxZORsyUbF9jkyB2IEZCHpHZiZaWXoOTnZusepiKeicLjisXoTZntMtcDQUJZ5l5yo0RQdYE8dldd5egFkwn8yNxYpX5ebesM8m4NBa3TonMK+PBiG5vQgqf15aaKEe4bY8+UlkoOzcBAvrqLPcvWlaa8teLaxZA70EeUGHMp11t548FExzyVl2g6C0WvuLiBipUlvbaKnxZ8mao6GVAuCYyghspwKaj3IoiRuDhCxGoga1krX4EGj5VAAIGa79kQWWNbTksjXyaectyBEoqyFEK13nmxbbwDC2YaalEe8JETAy9xDwqmAbEx7YhNOTqMEyN54lgHXSYrRmy5FuKZyxKM5OGnKBBZy1oKwtpFvhbKL7ndOGabh1rHRkce7GIerQQZGqdSsIciXx7NU5SKyhm+iykWprIwe1aXwUggUYBYlyBFudddLVAZCU07bqZBZfYrJujeSlDBSL6Cs9JZKGdOUSy9n1N5mCBnqNR204J5lngyicW+NZPN0vZ6LsbPUI7ov9cja9fBSXBDkofX44Xkrqfi2JQzVO10/zM9F0t6vSsU97M0eNk6H2xf7Lh1elYgjNYuh0xUntSgLMMgNdmYKuYKFUpk5XnNWu4Fyp6ByzODlJMQL9c5m6Zhm5ZnEGSXGGZhmDF/yB0uVHUbhArWuIoj8Pj0FGWG/OjpcLUDjmkgMkLMN5ZFisovgZaPFWZD17crjIfPkYW9CFNmphLEpmwh0DfsV59jndZJPWPb3QR+TPSept9dHz/f1HHh3DmThzbfcYZNZ4KZeRH0/PKv1IRQvMooWzaatKy/NSDgGavtaTCH1B22u2y7rb5R7G4tqxh3vVnNLPWE2ssZrs92oy7VRDXJhIe2GH0F59cW3Awlgkvq2Uvqyk7mJFAkGd+AKIQ5vU7hy1ASu2rq0XzlY7OPykeS6HJaDYy1ASzkQttFe1Z6t7g0ejpUwObvZx/I3Misg52bl0WnHjbtO9Zp9zX1hRfTcwFtuA/7HOn/FuWKy8txYo9uck2VgNwWaxX0vLE5D2eycj7Fr7BlP9x7QnaWifuaAr1t+bv35OqlRmIClTVyoTagtolhEwaWIsRlAqODUpWJAUtIkg0CwTNSmozTo1eYuuSEBC6Raj3r5JwbpSmblmIahm0TldwTtJGQOz6CjmXZPSLzjHLBPXfJPfkUv56umUsWMWrdMVAvUVNSl4ul+VijPl+0qL+tap5/ttuq0rFTzoCkGVyoTSdakOujKmY0AqM4fqhcqRlJkqFayTFLxqFtzbdMXMMXt+eFfq/ZTqooX0jKToKH9urx/KXxlTPh2z93PWld7kl9JiVbPM1I4m1zJTkzKlfNIxIBWtk9DYQGNEMXLMklA703jyG3aLnI7SKDpoUp7LzOn62MQDqdcvcZJiqHa9HIJjXmzqJr2e3+KX7eNTR/FUErUrzi61zwVzJ8q3mxQcvOi1Vc0+JnCuWZzA2/gVKDadrpfrBCVKu8ycpMfZ+UpjpJrUtmVEcUNx5lI8v0lXJKpU8FdfGLpSGQGpJKArhu5FNyM3ofgridP1tHiV4jmhcr2th0sMLwnlm+qR2tu9+BflbwiucR5IBQeSYkhlAEmv/7fo9phRe10UZ6oPNykjtT+ntyFLZXcoZug4XWsWJ+pLv0G31xfVJ5QoPnv5BPXigydqHygVQ4pltZ/r8dABqYyct+3Guib10aJVE+oLPTaGUKLP/Vm9riHFNbUp1Qv1u6Q4/4bdMtjjlMauMnY6ivuiozGI4rjHXY+Ni4/3PkPxRv3ibT+OwcXv254X6WI/kBQn1SwjtY9tZUp90Un6nH2i/qFKvxUfph2U+hg5pH7g0HglXWoAKFE79jg+9XgzCw5e8j+NUZH7ph9PafyLwen7uUHfRiefHxE/18ZLyeGAqQrL2f6EJfmkStPzi5yi7DlVIrzaigQvdOL3Nc+o+7aWER1gTkdhou61TOloftT4ySEQ9NaxySFcqOPlHLTeVi8dXql/kO8kzSznmnU29W/y2lf6z3Jxn1sNm/Kll25GSJAU++/TnvJAKkW9j8flXDdLWTfLmWqWMsWcLpUKzRt0XDPLGbzkphnFD6A8mQWvJ6WiJ6WomqWkvyX/FrHefEJlHS3lhmBDXLlzdLjUlbSWmn7fdvOGYJukMCEKTHUFptYIJqEMU6eFqXaGqS7CZMnBVJn1YwmawcTiYbLkYaoOYRLNYDIVYOIIMNGGMHXnMF2JP9C17G1X0LE5AuPJ27Xds0/Ao9azlRomYA6ToIMpPSucwyRUYKLPYSJzMJE7mLgKTOUzTN1Zv65fq7UwdWWYWkOYUH6t7rJGO83e0GdfZymoc+yQwFhM+jrWBpH/TZ14xfec5N5Wj/yZaHp2eHC2OhdkVn21Ba27ymAekSDjqA98Ywtbsk5w63RLGQ3DOTq4c5Re96KAV3LX/BHGRMtU1D3iUbxUAAlylwSxKIZbvXDtEXvpKcjRf0PWZ9gW/YVOgmxE9/CuIV5t9QPsyDq0ujLxee7kC4AE8eilPdvTXpdHJswBS/W4ycDR34pHas9NNumcHJX+XDv4wirfzETZJOrY2YbdW+uuvdFzHb+ucztvLrfAdLfeVi8sAkTdHiVBTk7f6kGMYO9rxUilvVDS57Gkr20uNRzNETQPnh/rSBp3ab1A83Rf95h9TflCPw6vjuF8OXYTeQy66Rjw1tg1p2PXlsduZo3BfDlWzXSsJunYleSxY1pjV3LGTiaPVWk/dufWGJray/p+jghM9hS/LcxWEczcBCZiBpP9CCZT6pcpTNLTZQ3KYLZKYeIMYYYimFktTOj64FU/KNIcNKK5o+/1aH1I8xaVSaK1Ul/L9Pmb1ongUjuMXJovpKJ1aT2a9PXNC/mhrY7dRBsDUx07nTZ2zH2vCzVzxq5tjdWOymmNHd4aQ/psymMoWWNVCsZOF/RjbjJ9Kb80ZWESpTBTWZgpGcw0FiYyDzNtCJNlBxMxhZnFwsw5w2Q5hEnAw2TfwURmYeLw/b5EO7/KISNae7pS3/fS+qHr+1+zf6Z1J83pCehzdhld8nfB097YSYqTS3uNrozhq3pGNa0xSJwxNNUxoHroZaRyUbtrY9Atxw5PZV6OgRmMgUSxsh87pjN2er1R+Z1X9lcSmCkxTJxRH8OSdASTVQYz6wQz+QQTh4XJksrawWTPwUxuYWKdYaJnMJkO+/lM5l7bH0hlrF7q1HNfK9PnhOb+Xg+CerkLYNWrD9Aaj+qrx4XU15W0rnmJfzMYq910rFL5eGus2tpYpdie0545GDuJM3YzudeDSn1F0nq8g47iJh2DjGJk+cr+ex4mYQITJYaZTmASsDBRCMzUDibqCSYghpnDX/JA0MJk2cKEYmbJwURMYEJIv/el/WkfQ/04Ubu+HuJ6PJi9zw9BV6bXfpTr+1PqA1Turoz7+r4fozX7S/mpj7uZMwZzbexK2hhIai+bSv0gs8ZOshyrGR2Xe9vTeOFK0x4fwFyOXfN7/g8imASjC6anp8fLJi1FC8Ma7jUWGUgmc8MCIpKtfm6jlcCwiIztUtJYpTX4UAxZMtPscIUQWfkWJ665faea4heHtc6q5ErA1lNVkFnEhrG9DWULkbXBTzzDjniHHYmWhdRZutK1bTj3UoRMa7XSWfmMLCSGQqg6CYCerW/9BfC0DvEOzyUhGxUOOwJeigQT6Qq2OEvbEojklEV8/8XBWN8GazoXss/nStG3ONPahiuXe8WH3cz0LLKff1Fgk2iNibI0srOn81Hhyirn7SmeRcHlQ8WzOFGVQ8kSlIXFklhldV23VqKFkKiZ+kpLdUHbhrnLoo1mT1Zaqui6tOwcVjkFCjJthCrbXPIOS/RZynFOsqo0roQbfqTAuSygbSF4pIxwPm3tDMS+AFJVLs8huyqcbXn02FKwOuXgsNwxREvBlaZVgEoNyoj1FJT5XLp2yMr1rQYEbfPF4lez0AZHQHTDTpdDtQtHKhKXqlzzgEdNaGmsulDGWJ5s1S76onOrM0h04NuIB8akRDbboS0CrlaOHVZRNp1SmDIxUYZmKpcO1Xn4xYvrTkeuE8juIUCR56bDSsvFk22uKmBqLLCHQpADqKZ1a8yboymhL+ZW0XCmnGZZJPsssn3O3dqpftI4cYYz9xjay6HFRazGT5BujWpDKWPXOleuDdYeO5GMLRgaC4dVFysF2MoqEKzOs8AaSBbr58EaKCTGlnP0FkpjLsrctMBIl/edITerUCG5Ol/FIUtcNOegy4b5RtAh6IBo5yFCc6K7rHI2TJS5PEgsmyOIU9jwVLbqVu40OwRaqog6X+ZuEgku7wohq4v9l0+JaGlIWW7YlWhsQ1GXlVTLQojSSAcymrucguy0Zm1jwoJ8f/ITcJyRiA1MBAArn9c8ewyzSQIXIbIQkRFZnrx0pfhCaBqWgvxcE4K5m5nKsvVQ2ML5mUVs2XnWeaZm+mrThWdPDs8WStemtXKx7MoaAjOXHdlaqgDTUlu4LV2fuCcnDfXQXnZGNso9RT467STd8G4FFVdRE7dYdwDiRORVfnKvp5NClXXRPJU9LUORh1qqZFBGM83iJC1TxJBFwlUHtZYqQsiC3LbIJuTITCMKMmRF0Leh/SiXla4UsAgtwyJoRtIWbvVE78jYJtGK8mVmJEX8ubNTlQsz0LgWWPjp8GSjMPXlc2PmbmzLK97pVja2zs23cg3XLh8V3lzrzC1y1YSwDhuMMCkdY4u++yXk6y8GNaQoprzSNUunPj3TrCZXtbIKWZLg3FWMXGstGyVI1gSDV5bqVk+wdRra8rIC8qRdc2DoCdOTg6JtaIdfXPt8D1KCgnw51CW90rjI01jigE45zhKXM3KQhHKY6IreQatpkTxyPLY54QU5uxKSoE3SYFGckBmZfheZGwEBC0X3fhYt9HQ5dG1rqCEAsVwfkeWyLl+s9TmysNwsHUuf6/xKsVA5hghswk5rPb5sfYuLkaCURlZuw7axQmtl+3bdWhmagy1AjgDOGuecTEk/BWRlw60yCvZlhNKJZ84ayeVKycrKwrFKAy3CwhPE1BLKs5XpeiBMBccGQzNVln7csGjeiOaCnB0hFP1ETw0+YP1c54MF0QwE0CxTj/4CAZ8rhnqXcqocdeY2vN9wxHJ4stKtUsc2WqidW4SdPnPaSWOx+1ZPS9vKgK0vwBalbuQmwRHNdUOfg6EX1+uAT88aUTpMlEa1zrUvcydgh4Jmsuvrl+SKmWo/yIHF59dfuhjG5mEtO8bDVAefvSr/5J3qTzUOKtzUmZd7e1x9OtQD7NXNgPs0EYQPI56bfJhMJtdVn/C5wVXukYegyMqixlX/es9gP5LZvXk9zrBEY6Yv780lBA/qFEzn1zcDpkD650+uD34dVHHZxEU+uG4ZBEWWeXk4SDWHFJPH8x3DlNWHBTRMMFXlh3tdVpbbz3Xj+QQPHiUYPErwWknSUv98h5vgrqj9Q0zC1wsNeabLpvEkmQyke7gE5oOlbz5HTVPWn+7uXop2+yTarZd5XZF7p/o2KLK7x7M30JLsqTlbPGzg3Pg+SVLs67cIPb308T3evxm4bYqMfP9dkL+mRRL/5/XBI6Q44fAhLDIvzmvmM/NX5l2Dvez2SvG2qPbv/p15Fx38W7/Cp9fjp6JKcfXtFPN4QuAxn5l33+c68AZB1dyWOHt388jdheA/zN9/GR+vNJ0VedxUwfdV+ROj0mnm8uLcofIoepldUTHLzNtjRqTH4IqJc2ZqG7dPu6QiqD8xj5bP+jN6O/d/3YVFcMhw3vTkLmO3UZORmycCswgHKYOPuGoZgWVqHBR5WDNeHjKk2DNNwdRtTYr945E1bpjQw1mRMwL7bIwuvqz8SntKVc54QYDrmjnGHlPXEdMc8hyTnjDGTBNhJnuUvC4Ifn4OFStkyqJqGP4jx1OmrrP051BjxgvDihInReCRqKibZ/Pe5fQwi/NP/RFfGUO4inct00Rew5zw7yvM5EXDYK+J8z3dd2ELZ0XVMkXeP8V53Xh58MTfbCHP1tcIwrynIeTp6Hj3uPdQU9v9hfkw+h/PGKNWHTFBGxBcPxtuIpwz+IwD5u5QV3e9SHd+nN+VRVdUftE8eARXz6SQ8/pQXVRYFUXTv+dZt3WDMyau8983zO5AyEt+leVGvvLcb7mfmgvm7jnndekF+Inxj+y3jDdx9oLvU9xEcc5w/8UivXatf1C8p7RT4qqOa+ptV2mPXnVHYv9HUftfQAsXn7x6SLxjTpgJvJypsBdETBDmt19f6fsaCQA05T9kkdeGOP/jJ8bGzCkmhPHIyWtrZo8bxmOGrMBEuMKMjwOP+k+xYwISU90EuGrql9qkoGaqCJOHIMwZe2kumKkk6bJhvGLiueZ2Xkzwczct43z/TyjjTZI0IgyHwvOhqmiKoCCXUPhsom685kCj/ZAVXpmLqWvCFH2dUDO/MLPpTNbNpbKcTU2ZIukat6uozu4C7+4i7+CASxremV//KaGeMsJvCv9tivi3fqnv1dGT0Q2ch0y/p6Z4eSRz+zKr/L5mcH6MqyKnuYA5elVMK5ya8SrMPKYIHPbQ+PS09R9OKj/JAC11CFQZmI9g1izZkl9UJ18O+IBfFSXPy7i7mCa8gX9JeINHkQZ14+2/QkmVDWM6lz+/+7//+3/9H+a9CsHSfJCRDMzeP68Dhqyj5UymMfw60mPaax4fpakpP76Cq8uGtTE/v/+Dd6qZ+kvN1DgPBxmu+ygwGPSMDw4VYd4/ScUMHhcM/CJsmXfvr4y9++OVKg6ignl/oX1zUx3yIAsvb94GUVaEzM/nvwMzl6XsB5Z9XUoMmEtIDBrC4JxalRkM8uJ0Sapv/LfAP/Le/3lQR5iQS1X9oxf/n6GT5u4BPhRMGZeYeu9NXRyqAH//NeObn5g5bl4kWWYp3d4sgWFOwUx+WEqf3/8hoIofbOoelp/u7rjx5JYfDW+vv++I1+C6uctw4w1Cr/HuHmkN4vCP9IxpXeOM6oeWCbmX4dsbxdpsnqr/z+/e//L9huDXwftfnjHz6ztK7r6K84YpDhfGc3x6Rre3+TsDN309cc1Zj9PUT9//8uLoX297ksZVC6823N48/kWNXONm8ETq/Qsy/z2sfVXOpUnzqYKerN4UjL4AF2XoeE+zdvUSF33YpmtuXjlN77MvWima8gaXocHRIwfM/E/qLwOch2UR583Fk395q0n79brlSiUO6frf6Fl/Zf7GJF+YQcW8uzX6fUZTxfn+HfOXi0Ket6cPV14fru3pbVIX+c3j9rdWvvs7iTF/Y3ojVRkz2P29DNx8r4W+/ksRMxh4h6b474Q1CZekaCnSUtxeWhta7cS7OKBB44K3y6LnlSczmz5fd3vjezUeD5lByAyYP//5z8z7X179P8KvzF+Y9788vx/49VlD+OqUp7r2N8548SLsd0+4Evqtc1Lc/v9zm+/eLP2mr7y4O3rpHM+n3v1o9QX9Twp9Q3dUOVR3z/zkO4f/q4D+RhaNB8OEOi2B7kJ8vMuPGeZy7sYwp6Z8uZn6YZ/zKj8dyq8YqZui8vb4az46lI9jtIh6uhO6iXfMvzH7CpcUC49n/srclVVBy5ND3tR/6svim2dtnSwaTFz3fVtL69scB7Ts3MVV3ZestHIzl6qsM3HO/MLe3gos++ufmLC4eWzLGlq6PRP+6Qz641fYS/u/d/Hl/wsJxiXD3TBMWOT45uZrbxXvmK1ivGwpGY9U2AtbJvPCvs3vZTzv6oc43xU/OjZLd/XteVe/mL/pWejPU730O70sFQQzYVzhoCmqtr8yiOs6zvt7liwN44oZvNTthdw0DGma7KvAXd14fh/OeoXTnRfLvv/lGS+/vrQQZTXEO+9AmpphGfYd8zemwZgZeM+IUh4oyZdC9QzomMLRkDdxfjhfmpTzpXGsMEUKDoqcGejHpz77so1i6Zm2S1z18hZ5vzWIihPdxTy81tSnb0a+o5Tn1zl9AXVFbFwzpyrub3NvGKYpDkH0YvfdbVkVx5iyEef7h4BCgwrSx4DfXLiL/2Xiwd9TcH3P23F1jIPHDDgNk0PdfJ1tCob0FyfU8z0mL3Lag+WhV13v5Hp9xzVD+hu4OMWkpZt8fPMTUwdenuOwR2dZFT4Ob29+YkwowZd3FDmmiy43hBRAVRxc+vHrtVuOm1NRpQzBR0xo41YXGaXf56J/Z/xDw5xoD5v/vmEi74iZuGGqeB81TF6cbm+ePKnH9gV84fX3N4Fx4JXxbV0EKW5uw7sb6hX/+LbiiKsqDvFtUOQ7msf66HwghPnznxkZKjd/Nfql/3mz6ZVrNBX2ss8vnyYfP4xv6OKvzd3lznVQYVJ44aUBwSXt31+z83uqyKxoMHO5yH6ycm+LC5/17TPKmVenT1Que/6Du73uuvlBe/m4/nLUddtVC7+15zuK+8aTBoPf3fy/AAAA//+GwRQyNT8AAA==" -> "H4sIAAAAAAAA/9Q56XLjuJn/VTXvgHh6a5LqUCJ12fKMU9FB6rBIWTwlZVMqkIBEiiBIE6Cunn6R/bN/9/H2EbZISW7Z7Z4jlapN/Mcm8N34bndjyjHlgnlI8D2IMsKDBKa8EgV7jH4EbpxRBNPDw406VOXOxNJ6bX1+U8q/BBunLIjpPZDK4nel70qCcA30XelCuxewJGYBL2Ah59DzI0z5j2AVEExhhB9uAhrwsrda33zBMlNI2Qqngky9GAV0fQ9u3YBfARQic7znFY/EGRK8mK6C9XclNYjwV8J9fw1TKmUMp+y+BIAAcgnuAfaqQn5YAgAAxvwlzLgfp8ERo2WIDwVs/iOAG8Z8IWUQtNvtdqemHWFXOnhVOf/staftTrvd7ran3f1mpQyHpL/q0lbgkcEhclK5k5pWlYybPDT6poSTW9R9Ou6kzbzpUH9KnmZqgp/SQNtrM9K/85xJq6IrSQeJx5ay0w4fw9Xab62ygzavt4YfVdicHEy7s274WqzsV/qs3wgG3KsYU0JdWQkeEyOskyCJ69MF7/Bo3X5eh0a72Tv6h7XbzBpqK9ibw33d6WwyQxX7s+lR2yR4dQic7CMb6h/9qpVOw8d2J8uG86mbbshHxbcjON6m24M5qWZswrd03tn47tPuMLmtOk8bmDyiSss34fOTLO2UQ9NSqnTm1Z/WO3EdTN0mC1zFPN5qJt47tca0dfecTCeOOn/0kvUiJQYcDB4Xhurz4+RWRYt0MlasWWxIbdw+1Nc+97R00jGJ2zC2T7e141F87uhK1etO6hNxlzR2u+cnf7urUu7WEnP8xBHmo492Q5w+0YTODoZBF0n1qOw8XJXc2b55S/0Wof44Xaw3+NaLp/SprewrHqk1ZWN0WAfZk9fZfQylu3lG5urMeoYdHu5G41Df9JKNOavihjqSmnHvlo0GXr3iNMLDarxFKrN99Cx1Z4O+bU+SY7x2xVbDngeiPlMSutArErbX3Yr+0bEPfL6a34npyp54qB1X+4sVHTWOc92ajUYtdRFCut/X5FtrEoTySGsxa1MVxWOzeziIw9Xw2XRHUqexul2hGvT0dFzveXMLKcOK1DloTlORNrfeImj3J6NHzT3OFNGs8dXdXsTS9OEBRHATp39NMfIhL3txdPPa3zGqNhpSq/D57snnyaI3lDRTbuRnw6eOtFFIPWkqZifYD8zmbhI2Z3d0U1nc4vhJm8oVVdw91u8ajyB2MwSDV8xKuzTgeJlnhHNYJpD796DCo+QU3ss8Ryy3MGWFZN4pC9yDn8+CToyONRz3lt2Jqg7Nh7uaB1d3oogb1Ua17tal+up21XBXDYhFVPNaUtW7a0mt6hm7O1GfJoasX9BvVw1cayLUqt9JDXEFvbor1pq1ptdEtZbr3jZxFd9JaPWWeXvZlXXzYWyIfGxIXd1CIzPo9HR7ZBnWYjQVFUsv7kTeDaWRYemyLWu9qbOYLUSlZlijzkIkttXTpmp1ftTsTt8KG5JbXYg4UhtmL6zqfd9yq3oHibruWMnYlZIRHCw2ZqjourV7nBKlg8TFs27b2jQkg6mp2Lql1JC4D1SxkSwUxDwp6WmzxcZ1tJrR9zdmKD1PZ+jJlu2maesLbEmybWoz2Ncm5izpoF2S39Vf3YXKzLRHOhJt6li6Y9mKrMuKiCL1YGwU3675qdkXG9hOmlNR61giqemKsjBCvnVCEqNIm3QLmUddy1LkRRUplqzIBazT6uXf01DRprSTOrYyN2xNnR/9seMkmmUTimlHn1haR5VGYzVCQ73X2c9nyhFt1o9ze7SxQ7WqEbWxCP29bll7aO1tR76rqb2Rjjf2EVaTWK0le3NABtbGr1lkvh1XtZHqDPfepmNjOzHn4h6qklez7eQw3cWi1tOjeS0+mjNSdxWtaUv2wpI6dBqSMeyjzmSgcI8khuq0ormjH/DANswuP7rhQjYcXldrXjo/Ko8L287USGOqgpIusUWnNxro0qKnE6SZVWW7CPXUUeyeTu2xMUCPloP65kA/GrIGHUeLEEGOoSRQC+t1JKKdShTomMPG/OhL7qzzrNrtR0teMEdW64u+Ak1Z8h2FBLrZ0YyZ7qiyNjRop6aLZDenJHNtYrldftSpXXV7+tbuSwc8iLd45jc9Wa/aofTkhcrInSZ1t8pqHrG5PbBDvW8rljTqmlXUUS0uzS3JsAe2b8w6unschW5tsX88tvd6ND9OrfrBtrQOEu3O1FEmtiz19RkaWjaRu2RhqHKrOyVE0cO4tjAXc7UW7hb9FvOM1uOcLJJ5SBJU1TNLaqdaKHUnMuqoth0aM6Q7ltSdW0rf2CCikfURm53Qre4ev4HbueDqM6RMg1bNshba1JK6U2defz+u9i8+Ol0nHZ0mVa1KiCF6DVdJxl44PJiOBKGs7A2ZqNjZ+2aNOJ7p1fQj6Zr2yNKptnOoJaqDYU2X9Npc1GMUrSXd0raGogTdaJ8iszPXrNZ8IepVZ6B1vX6rbwxGVVXmT4azNzXJflRn853WZ1uDEOoMvNTtJ5Y9ULeTWbJzN75hR3vuDaytLkpPpmk9Ws5oYHX5BG5s6B3tSBcXMyjXa6Y5lCyH25Pe6NEd+MQIFWbN/OG0uu9ZfbtuhZo2N5WGNmvX7H6DTnqdsUGQiO3OdDJNRKuKtClt1zTbNhbOnahZVt2Sk4NB20c4IFtNGdUn9kjXq/yAHc0wZiiahn4V1nzNiBaZV1VrjtGqag6R9I3PsSw1uxtNnIdx41FMGrqlSMYg3s9DJHmWNn+sKY+WrVuo29Ld4/yAQjSbW2HDkhbjOVHrc9tXp8fRRKPKBjqjvbex6ouNLhvh9NGgGjONu5o30BreRtlqM12ch6NMI6E0namtbnDKybrVkIeyplhEH+kh6U1tXTnlcvHxbaUwjPHyUZ4by7auPcCU3sMdu2fYSzFnEaRwjdP7jAkYMi5I961a7bZRlVq3rVbrDHWP9xynFJKlF0dJzHBadJrCuiGLa/PMzrA6RlcfPpnDibZU21q7fy5Sba33j3Nmmcu8NEjynlw4owheHEWQIiGczkncuvCfG6asLgcTw9Taqrx80mVlOHtgHLoECxcNhIsGb43UG+oPFcy9SszcLCDoLaAhd3XZNF40k7Xe02SomUtLHz/4nCfsvlJ5rVr5RbUyjOAxpnDH8iaicuE9nlg9p212B8vxpG+8T5LEa/ZLhF76j/dk/+qgzOOIvN+W/C2MN8Hfzx+QkHiH0RLFEQwoAw/gb+CGYxiVzxTLcbq++TO48TO37KZ49/Z8F6chTr++AhcOHgQP4OZ9qT0oeCkvJzjvt87SnQj+bvn+aXK8sXQU04Cn3vum/B6o+TU4zXBZCnPvBas4BcMIrjHo5GxwCgIK2o5RfsHqxR67B5eXjwoexTsXf1VQ7GX5PFqQO52VfR6R0guBro+9EOAtTg+gJgKGvZgiBiBFgMRrwGPADozE6wtLhjlAEEcxBTXx6iwHPkF+od3OTQ6g52HGwDaA+ewJeEYpJgVhjAH3MYgumrOY4Gs+uVoIJHHKQfVOquZCnW/zn4xhABFKc+Ik9iDxY8av7uGJO4oCel+w+CKYjdNgdQDchxzs8A8pBjTmAEMe0HWOdxILR3F6ADEtvgLKOKTei3zdgdx9PGcQ8CFPIS+sg9UFN2P52/0F3Db+40qw/FUbwDt4BLOrY+5jCvAee6CSsbRSqFRxA1pJ4mOcujFfQoLTKy1kyrL0ZMI0jnmxcmAHxnEEAkZ/4GCVEfJaXmU4ls8yFyhPbXMAKteSswR6+EXwO/FrwXkQvZJ7F3A/oED6J6v0NrR+p3ovZSfBKQtYHm1nbbcwrZDA/VbW/hewwikmzxESrMAOAw9SkGLo+cBDtPxluvySCbSJKf8x8uEBYfqne+BgsAsIAZDs4IGBNeYAgrpYAz5OMXCxB/P4iVfAI0FuGw+nnL22Zu7UIPUxWXqIAmdoDkC719Nlw3gjxLXlVjAg+DpMk4Cu/wFj/CLJPCPU67XrozTmsReTUyq8umAc8izP9nWx9ua5AGMExEWfwMAn0G3n4+1QGXbbppx70jlvpz6LKh6snPQVMpzk6R18/oeUeqkIv6r81yXiDwWoC5n/8ugGpggUOCz3lwuZ8uuq8gMDmG6DNKZ5LQBbmAZ5h8MATDG4lAiMCte4f0H93UXle1mzh/pEU2XNvDjz1JIt+VV38pzhDL9pSq7buEqQFzzBPRU84aKSwDhcf3ElVTaMdl9+uPnf//6v/wEf1Ik2NJeyLWtmEZ/nA0PW7WFXznP4+aTwacgvn722KV+2QbpsWGPz4cMf4Y4B9swAwxQJEWZFFhCEQnAhSwn48KIVEC4AghujA7j5cBbs5k9nqtjzY/DhRLtUSjPqRei0BPL8KEbg4/43+MwJVLwVxbethABOKdHjBGCavyoQBBrvTkX1FxbXv2cFvReYjwk5ddXf2kFfeWdeuwWcxSAJEpxHb4nFWerh9zdepe9BH/NXRRYMe+XSUDPMttaVl8Pew4c/ernhhTEr3PK+UpGarXK1US+ff1cI5JjxSoQ5FBDksHKhJQToTzmPNmM4yu2TtwkURrhcUqzx+KX7f7j58On9geCz8OHTlTCfb3JyT2lAOYizk+AU767oFm9+Y2Be9BPnmnW5zuP0w6dXrD+XC5LG2QpvEMqly1/5IzPMhRdSH16R+fd47bNxTkOamxvo5dV5DPSBdjKGjtd51U5f+0WRtnOY0pugKWL21SiVlzzhdCRsIckw+M88XgRMURIHlJ8i+dMvDWmfzyhnKgHK4X9lZv0MfgabZyCk4KZsFHgGTwO6vgF/ORnkejxdnmVdnsfT8obFtHRB/yXIm99IDPwMikdKIyCsfqsApfdG6PN/t4AgwIzH/06+1sMJiQ+5p4X4cBpt8m4nWAVenjRO/nYCuu48Qbd9DVcuuZDhZh0ICAjgp59+Ah8+vVmNfwZ/AR8+Xe8HPl8NhG+4vPS1IT78/7nzuxufX/XhVzud1057fXXzLeiTV74Y8x2rnVGE3Di57b4i76X8n0D+8jRX4fGObv8qvl6SO8bSMCd63vlUEN5W6DbCEpVKhtk25dNC6pvjzZuylCVfXJDxOIVr/KUMZcnlLO+dXlZBpWAF/gDWKU5yV7vw/AwqSRrnXUlGOfux6IZLV9Oc3DFAwIpx7ZC3tRR7ebe5ClJWdKp5w2YOVVkHAQWfxHK5JoqffwQoLl2mMZ53bFfKv/DIf9wUw7D4exWc/sNNME6AVAIAxRSXSl9GqmAFZorxepIEkKQYogOIICqm+0LH/YotA7qKv8U2ClesvF+xV/elQoSCnwrDd0bYXBEMUJBij8fpodgUBIwFtFivRCEKUiC8tu2JXBuhvDoWzd+KcegWWawweI55etkPn65k+fz6hXJREV7BjHAGRCDegJ8BxxgI8IpoLkNO8rVShQA6zt3RkMcBzfan2WR/mhdTnHsK9mIKBH37Ml6f0HJfurJ2gtNC35gWqJ4f73IssHxrqfuvTt4xyvUWp+ibzh4bMLBLg2KJWwKAx5nnv8KulJM03ga5GAFdL73cNXJFihzwq4Cr4F8mH/yWPuu9aMfpNvAuha+NNhnjX255DEixL8kjHwIa03z0ogim51VcYe+AAVIs3oIQk0OO5OLS94B5kFKMCu9M0tjFqFz6HpiT3uT1aoLiHOi0GMwdKA280xh+3rZRzHdxGgKCt5jk8xqLo5x+Uer+DNyMg10+utIfOPDhFoOAgzRY+xzQeFcuvURS4dsn50Pn318lRgEmQZnFXoh5GVVKeVT8frR4i9M0QLjsxXSVl8kiO2eEgJ9+AvJEKf3NKED/XhoXxjV4imH08PqrdXfbLOXAX2a606pVSDGJITrNHTjJx/a34vyQGzKKOQan/fXLKxdvcZKTla8oR5CFL1ROOH+Vymes0jemygv8idUZ7WyFX8N5x3BfRZIgfFf6vwAAAP//taNLR7clAAA=" # forces replacement
      ~ vpc_security_group_ids       = [
          - "sg-006abcb539c009c0c",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sdb" -> null
          - encrypted             = true -> null
          - iops                  = 150 -> null
          - kms_key_id            = "arn:aws:kms:us-east-1:933752197999:key/9630f91f-f3c0-42eb-b65d-3defffc79926" -> null
          - tags                  = {
              - "AppCode"      = "IMGB-001"
              - "Name"         = "🏗 External Composer (stable)"
              - "ServiceOwner" = "Image Builder"
            } -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-04cdca8908908504f" -> null
          - volume_size           = 50 -> null
          - volume_type           = "gp2" -> null
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
        }


      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-0fdd67de1f780e5d2" -> (known after apply)
          ~ volume_size           = 25 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
        # (1 unchanged block hidden)
    }

  # aws_instance.composer_internal must be replaced
-/+ resource "aws_instance" "composer_internal" {
      ~ arn                          = "arn:aws:ec2:us-east-1:933752197999:instance/i-09e9fa426e96bb81b" -> (known after apply)
      ~ associate_public_ip_address  = false -> (known after apply)
      ~ availability_zone            = "us-east-1a" -> (known after apply)
      ~ cpu_core_count               = 1 -> (known after apply)
      ~ cpu_threads_per_core         = 2 -> (known after apply)
      - disable_api_termination      = false -> null
      - ebs_optimized                = false -> null
      - hibernation                  = false -> null
      + host_id                      = (known after apply)
      ~ id                           = "i-09e9fa426e96bb81b" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
      ~ ipv6_address_count           = 0 -> (known after apply)
      ~ ipv6_addresses               = [] -> (known after apply)
      + key_name                     = (known after apply)
      - monitoring                   = false -> null
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-0df7102235a986cee" -> (known after apply)
      ~ private_dns                  = "ip-10-30-18-10.ec2.internal" -> (known after apply)
      ~ private_ip                   = "10.30.18.10" -> (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      ~ secondary_private_ips        = [] -> (known after apply)
      ~ security_groups              = [] -> (known after apply)
      - source_dest_check            = true -> null
      ~ subnet_id                    = "subnet-04a176042c3118735" -> (known after apply)
        tags                         = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🏗 Internal Composer (stable)"
            "ServiceOwner" = "Image Builder"
        }
      ~ tenancy                      = "default" -> (known after apply)
      ~ user_data_base64             = "H4sIAAAAAAAA/9R76W7bTLrmfwF9Dzz+Muhz8B3ZXCQlSncaRxRJLTaL5lYU2dMwuJTEpchiSGohv86NzJ/5O5c3lzAoSnZsJ3G6GweY7gCCw1reepfn3UrUnBQNKpqh1ZboI5PvcZOUftXc5MkJRX9gArIvIr9qP12pK1UWNRtIM8O9GtCnIURVnZDiI8Nds78b/G4wHD5f9LvBI20pqUtSJ02/1m8aP4xzVDR/YLYJRoWfo09XSZE01+F2d/V1l1X5Rb1F1VAuQhIlxe4j8z5ImmcLepYbdGpuQkz20TAkxTbZ/W6gJjn6hrlfnq8ZDPY1quqPA4YZMpSDjwwK+SEdHDAMw9R1/ODvm5hUSYeihwy1/Vr6b8hc1XU8rGqfmc1mM1EAnT/n2pCX6aM002fibDabz/T5Kd0qqxVebOfFNAnxss2dShYry+bx3aTJzIXFofJ9NL/vjlzqTpwi1vH9Ri3RfZWAE9jgxYfQ0aY3hlKKEdtNlSNof822u3i63bfAHU1Xv6r+RGstKO7GMSDKaWtsFuNk2YQ3po6LQFaS29LMRjgpyUj3GrHJd7PPu8ycTaQubnfBZD9Wp8nJWp1GjpjuTZVdbPQOpCXatomz/7VeGb/GvF3p2e1M3O9Xrh5UKf5ViWHu3x2qQ2tp/L7WmkPhimkc3B9b7T3v3Kd+eRvdTGPL/3wvc0elndgKX2zC0f3uyO4SPZjUSaBY3XtgoZMjjPXph8+lrjmqexuWO6/Cpr9c3nqmGjed9l6NvEq7U+wNMbkZmrWjXdyEoNJECwdj83D/Xug69rNoKHw410YaeyzHx+Pn+/hw5IsmEErr7r6JULP+FY5Z/b4oi01rmoVX8p1yDBHPBZvT5H0RT3ER31XeLkXvQ6IX9zPldBNiYSKb63aX7O9D8fhrxn1w99hVN/ZnX2yy4/ouM1KpTK0Nj8bqmpsQ6X29XoajG2ectdu7Q6TWMI4+c/PNcgGhVnZkF7DTMXQT1tgoZeEZNxyCu/mN8asD28bduh/Yagu1MJoRfuFti/W4cw17s15PVS/zi9NJkN/bWpLJazCt7ZRn2W4yb1t2tV19toI1J46377eR4IdGdTeSQteOlNUNJ7bAmShc+j70ktlCW9+CoNsorCU02w8nFnH6p09M7qek+q8KRbHfXIckv3qJdxTx4zE37TE/P2Mee9KKA5Y8pmOre5FLFTwqJ4olJqelNTlq2WTzoUhvvPeI3ANdvlHZ4+3ow/iWIcE+8pMXhw2OVdKgBxoRLm5Z+k38kblp8vLs3g80Rjwc/KruOQvPUeAj89cLo5op2qs76WGuqerK+vRBCP3tB5ZFY37Mj4IRN9q+346D7dhHbCSEU44PP0y5KX/ZPdfUe82Ujcft77djJEyiaDr6wI3ZrR+OAlaYCJNwEgnTIHg/QTz6wEXb14fPHuayYX26M9nmzuTmhh2trUSUDLi2Tdtb66xiG/0c28wzbm3ahgxlIOmOt/FYRTDtteixGNoS0FXe7QAUF3Y25gLeY1Guji0p441FbAe8IUasYTh2eRdw5dpfeqmVKYZhH291rIgR6302IAR6hpe6pUDDVoSIPSUqOy49JapDrpTAxksDBwjmIk6tjPusb6J7KMOJBQ0P2ZwMLbDxF0CzNqUYHUs6N3oxlykbC66NiIWFYxuODRXZkBU2ytXWTJUYCnFlLdgxguVEZ4Fos1gwFMUzs+bgZJhEOdDmPc/ruW0rssdHii0rcr/WmUr0Wc8UoBdi5UDFNSFQ3S6+c5wS2BAXqBANzQaiyq3v1DxaGZJ4cjdKF6W7WxeuU5ipPMDq2Mvik2HbJ98+QUf+IKjS2kAp7Hy+JKpQnqwlXtppLNjYPdzxYK06q1OYihDB0nLZk69yoQBh2epHwgLJyF2BdNYGjwIFTCAHPZsTCz3Dd/4iErWl0oS4NFVnmruO0aIlNK150wWZJ5tOM1KFsHI75daDcK/moFaVqJxjyDrSemlwnmTgCFi8cvAyo3IUKBkFvDOX0a3tRAtraXSmDHzHAXmEI8dUSh9ko1HERkcVK75jrcZuF3PBRvyswtmtLXu1I6sjb6H4lszFjoITwxKBuTEcVQYrsxAFg8VHt8D7AGI7mDedUUA+kIwDXHAtWpID2sSTUDZ4mHH3YaasA70cBXwthBg2cAkzYwEVm1vPLT4SVbvhXJsz4RLG5kY0gm6dBYJ3uu1mJyN3O90etdAGYsRCUXcUDcrcwthEKxtieY49U5Wncx1jxciI4FmeqwrZ0VtM69Cc3rrYK90MlxFv7G1uVoGMm2tyJKoQZuYmMhybm7u2sjDTCAO865AlZgF/vP3BXvFxr7GJFD2ZCrbtAd3m5rrjjr7vV6cnjOq7UjSKkgc8xiYbjgOlvAuzVWs5nO/LysmUsYqcU2wJ2AmtUDA6PLfg2jYKcHQKm1WXK8HgDMFlDRLlO86wwcFUlGSen6rIEl1gT12PNXhnCebhYrowl2telZt70zlZgIO36sY9gkV9MDEunGVYBYvShkv1oG3KY5DGJsxPTbi0DwbL3VuWfWs766U9bzQ/hX7YwdxgvY0vjwTLWnG200BNWt8GyxibmVLbm3il8yfJXsCRnQHgWsoYbGYCXIwLTRLvTByxCIq6ppeszUdAL2YCgND0nA8ssO2RLZetWcw6f4kPQFmPNLg2DL5pkQNMcxPlehbzvhADM/f2Ia8KjjnlgYM5I40bJHOTeQpYNyPjW7YcG7bCmUtycrOIC23g3grKrQ0NO5pPjaBz2yiLNq6djW3Ou3OxOnJhrOrdWgOFkvrO+hSm9shLDdnM9FuzALVlfhDCJRiHqXIAG4N1s/Ue4IzTN+p0npxjsmGP5ZUMFBsbayPDkg4N5RzL2dtvMgUN9DoP22iBc98BcbSwJ/NktlvNRdndGLG2I7vVfHb+KB4OC1AG/GiyktTdrSSO1CS7fZqfi5a3WZeuc9xZBWzcHLYv9p8/vCqRkWaRkduRo9qVGFhlDroyAx1hNanM3I6c1I5wnkQ61yJHNyVj0D+XmWeVsWeRE0jJSbPKBLzgD5QeP46jJWw9UxSDRXQIc8z6C3ayWgLiWisO4KiMFrFps4oS5KBFG5H1nen+LPP5Y25AFzmw1RJRslLuEPJrzndO2V0+bb3jC33EwQJn/sYYP9/ff+TxIZqLc8/xDmFuT1ZyGQfJ7KTSj0RaYJFWm89aVVqdVnIE4Oy1nkQtEPSd7nist1nttES8dZ3RTrVm9DNRU3uiprudms461RSXFtRf2CFy1p89B7BaIuLAUcpAVjJvucahoE4DASSRg2tvAduQFVvPMYi70fcuP22ey2ELMPFzmEZzUY+cde076s7k4Xgl472Xf5h8I7Micm5+Kt1WvPM22U53TkUgrKm+Gy0R25D/sc6f8W7arLyzlzAJFji9sxuMLLK7lVZHIO12bo7ZW/0bTPUfy5lmkXPiwo7cfm/+8jmqUpmDtMw8qUypLTSrjIFFEyMZaxLh1JSwICW0icCaVaZqSqjNOjV9i66IQUrpknFv35SwnlTmnkUE1SKd2xHeTcsEWKSjmPcsSp9wrlWmnvUmv2OP8tXTKRPXIq3bEYH6ipoSnu5XJXKifF9oUd869ny/Tbf1JMKDjgiqVKaUrkd10JUJHQNSmbtUL1SOtMxVibBuSnjVItzbdMXctXp+eE/q/ZTqotXoGSnpKH9erx/KX5lQPl2r93PWk97kl9JiVavM1Y4m1zJX0zKjfNIxIJHWTWlsoDGCjF2rxNTONJ78xG6x21EapNMsynOZu10fm3gg9frFbkpGatfLIbjW2aZe2uv5LX7ZPj51FE8lVjty8qh9zpg7Ur69lHDaWa+tavUxgfMscgRv41eg2HS7Xq6jJlHaZe6mPc5OFxpj1aK2LWOKG4ozj+L5TboiViXCX3xh5EllDKQSg46MvLNuxl5K8Vdit+tp8SrFc0rlelsP5xheYso31SO1t3f2L8rfCFziPJAIB1IyojKAtNf/W3R7zKi9LsiJ6sNLy1jtz+ltyFLZXYoZOk7XWuRIfekndHt9UX1qEsVnL5+gnn3wSO2jSWREsaz2cz0eOiCVsfu23VjPoj5KWjWlvtBjY6RJ9Lk/q9e1RnFNbUr1Qv0uJaef2C3XepzS2FUmbkdxTzoagyiOe9z12Dj7eO8zFG/UL9724wSc/b7teZHO9gMpOapWGat9bCsz6otu2ufsI/UPVfpZfJh1mtTHyBH1A5fGK+lcA2gStWOP42OPN4tw2jn/0xgVe2/68YzGvwQcv58bjE18DPgxDgp9spJcDliqsJrvjkiSj6o0O73IKcqOUyXMq62I0dLAQV/zjLtvaxnRBdZsHKXqTs+VjuZHnZ/uQ8FoXQfvo6U6WS1A62+M0uWV+gf5TtKtcqHbJ8v4Jq99pf8sF/e51XQoX0bp5RiHKdl9n/aMB1IpGn08LheGVcqGVc5Vq5Qp5gypVGjeoOO6Vc61c26aU/wAypNFeCMtFSMtRdUqJeMt+TeQ9RdTKut4JTcYmeLaW8D9ua6ktdTs+7ZbNBg5ONNSrGiZoWiZPdbSSNYyt9Uy/aRlhqilK07LlHk/lsK5ltq8lq54LVNHWhrPtXQmaKkraKk+0jJvoWVr8Qe6lv3NWnMdDmvJ9O3a7tkn5GHrO0qtpWChpWGnZfSsaKGlkaKlxkJLZU5L5U5LPUXL5JOWefN+Xb9Wb7XMk7XMHmkp5dfuzmv04/wNffZ1lgI714mwlohpX8c6IA6+qRMv+F7gwt8YcTAXLd+J9u7G4MLcri+2oHVXGS5iHOYc9YFvbOFI9lHbuN1KhqNoAffeAmaXvTDklcKzfoQx0bYUdQd5mKwUgMPCw2EiitHGIJ4zZs89BT4Eb8j6DNtisDRwmI/pHt4zxYutfoAd2dDsrkwDnjsGAsBhMn5pz/a4M+SxpRWApXq8y8Eh2IgHas+7fNq5BSyDhb4PhHVxNxdlC6sTdxN1b6279EbPdfy6zu38hdwCy9v4G4PYGIiGM07DAh+/1YMYa72vkbFKe6G0z2NpX9ucaziaI2gePD3WkTTu0nqB5um+7rH6mvKFflxenWiL1cRL5QnoZhPA2xPPmk08R554uT0Bi9VEtbKJmmYTT5InrmVPPMmduLk8UaXdxFvYE83SX9b3C4i1dEfx22r5OtZyL9VSMdfS3VhLZ9QvMy3Njuc1MNfydaal7kjLYazldquldH34qh8UaQ4a09zR93q0PqR5i8ok0Vqpr2X6/E3rRHCuHcYezRcSaT1aj6Z9ffNCfs1RJ16qT4ClTtxOn7jWrteFmrsTz7EnakfltCcub080+mzJE02yJ6oUTtwu7Me8dPZSfmnGammcabnKarmSa7nOaqnMa7k+0tJVp6VipuU2q+XuSUtXIy0NeS3ddVoqs1rq8v2+VD+9yiFjWnt6Ut/30vqh6/tfq3+mdSfN6Snoc3YZn/M34Wlv7Kbk6NFeoysT7VU9o1r2BKTuRLPUCaB66GWkclG76xPQrSYuT2VeTYAVToBEsbKbuJY7cXu9UfndV/ZXUi1XEi11x30MS7Oxlq5zLbePWi4ftdRltXRFZe20dMdpudxqqX3SUiPX0tmon89l7rX9gVQm6rlOPfW1Mn1Oae7v9SCo57sAVr34AK3xqL56XEh9XUnrmpf4t8KJ2s0mKpWPtyeqo09Uiu0F7ZnDiZu6Ey+Xez2o1Fckvcc76ChusgnIKUZWr+y/47U0SrVUSbTcwFoaslqqYC1XOy1Vj1oKEi13+XMeCFstXbVaSjGz4rRUTLUU437vS/vTPob6cap2fT3E9Xiwep8fga7MLv0o1/en1Aeo3F2Z9PV9P0Zr9pfyUx/3cncCFvrEk/QJkNReNpX6QW5P3HQ1UXM6Lve2p/HCk2Y9PoC1mnjW9/wfxFoajs+Ynh0fL5v0DC5Ne7TTWWhCGS9MG4hQtvu5O70Epo1l5JSSziqtyUdixOK57kRrCPE6sDnxltt1qiV+dln7pEqeBBwjUwWZhWyUOJtItiG+Nfmpbzox77Jj0bahOs/Whr6JFn4GoWWv1wYrn6ANxUiIVDcFmu8Ym2AJfL2DvMtzacTGxGXHwM+gYEFDQTZn6xusQTljId9/cTAxNuEtnYvY53OlGNicZW+itce94sNp5kYeO8+/KHBwfIuwsjLzk2/wMfFklfN3FM+i4PGR4tucqMqRZAvK0mZxorKGYdhr0YZQ1C1jrWeGoG+iwmPhne5M13qmGIa06lxWOYYKtBwIK8da8S6LjXnGcW66rnSu1O74saItZAFuiODjMkbFrHVykAQCyFS5PEXsmrib8uCzpWB3yt5luUMEV4InzaoQlromQ9ZXYB5w2a2L115gNyBsm882v55HDjgAbJhOthqpXTRWobhS5ZoHPGwiW2fVpTJB8nSjdvFng1ufQGqAwIE8MKcldNgObiDw9HLisopy1ynEkrEFczhXuWykLqLPflJ3BvTcUPb2IYx9LxtVeiEeHWtdAUtngTMSwgJoala35qI5WBL8bG0UHeXKcZ7HcsBCJ+C8jZMZR50T5yj3DpGzGtlczOr8FBr2uDaVMvHsU+U54NZnp5K5ASNz6bLqcq0AR1mHgt35NrgFks0GRXgLFJwg2z34S6WxlmVh2WBsyLvOlJt1pOBCXayTiMUeXHCax0bFnWBooAOiU0QQLrDhscrJtGDu8SC1HQ5DTmGjY9mqG7nTnQjomSIafFl4aSx4vCdErCH2Xz6loq1DZXXHrkVzE4mGrGR6Hmkwiw0gw4XHKdDJatYxpywodscgBYc5jtnQggCw8umWZw9RPk21ZQRtiGWIV0c/WyuBEFmmrcCg0IVw4eWWsmp9GLXa4sRCtux8+zRXc2N910UnX45ONsxuLXvtIdmTdQjmHjt29EwBlq222qb0Auwd3SwyImfVmfm48BX54LbT7I73Kk3xFDX1yG0HNJSKvMpP741sSlTZEK1j2dMyFXmkZ0quyXCu25yk54oYsVC46KDWM0WIWFA4Nr6LODzXsQJNWRGMTeQ8ymVnawUsI9u0MZzjrNU2Rmp0eOLgeE35snKcQf7UOZnKRTloPBssg2x0dGCUBfKpsQovceQ173ZrB9mn5lu5RrceHxN/oXfWBnpqilmXDccIl665gd/9EvL1F4M6VBRLXhu6bVCfnut2U6h6WUUsTlHhKWaht7YDUyjrgskrK3VjpMg+jhx5VQF52t5yYOQLs6ML403kRJ8953QPMgzDYjUyJKPSudjXWeyCTjnMU48zC5BGcpQaitFpdtNCeez6bHNES3zyJChpDs7CJTlCK7aCLrbuBAhsGN8Hebw0stXIc+yRDoGG5PoAbY/1eHJrLKCN5Gbl2sbC4NeKDcuJBsFd1Omtz5dtYHMJFJTSzMtN1DZ2ZK+dwKlbO4cLsAHQFcBJ59yjJRnHEK8dbaOMw10Zw2zqW/NG8rhSsvOSuHZpwmVEfEHMbKE82blhhMJMcB0wsjJlFSQNCxeNaC3xyRUiMUiNzORDNigMPlxi3YQAznP1ECwhCDgyMrqMU+W4szbR/R2HbZfHa8MuDeTApdp5JOqMudtOG5vdtUZWOnYOHGMJNjDzYi8ND3BhmMYCjPykvg357KRjpUNYaVT7VAcydwROJOgWe3v5klyxMv0HOZB8ev2li2nePdzKrvkwM8Anvyo++sf6Y43CCjV17hf+DlUf9/UQ+XUz5D5OBeH9mOem76fT6WXVx6RoUFX4+CEkeUlqVPWv9wxrcqhG2eU40xbNubG6t1YaeFBnYLa4vBkwA9I/fnK9D+qwSsomIcXwsmUYkjz3i2iY6S4m08fzXdOS1YelZlpgpsoP94asrDaf6sYPMBo+SjB8lOC1kqSV8ekGNeENqYN9gqPXC015bsiW+SSZDKR7bQWsB9u4+xQ3TVl/vLk5lCEasqE/mnJbVvjwYYomI38yfN+w74PDhFy/FP36SfRruvHaz/2OFP6xvg5JfvPI4J1mS87Mmi8f7rSF+da5Y3a09bcBN55yIyESuGFe1U2Bu/wak13909OeXh/5nha+GbhuSI6//1bJnzOSJn+5PPgYkyOKHiKS+0lRM5+YPzNXDfLz6wvFa1Ltrv6TuYr3wXVQoePr8SOpMlR9O8U8nhD6zCfm6vtch/4wrJrrEuVXg0fuzgT/bv7+2/h4pemcFElThd9X5S+MSqeZ8yt4+8qnfsBsScWscn+HGJEegyomKZiZY14/7ZJIWH9kHuGR92f0du7/dxORcJ+jounJnceu4ybHgycC8xiFGYMOqGoZgWVqFJIiqhm/iBhMdkxDmLqtMdk9Hlmjhol8lJOCEdhnY3TxeeVX2jOqcsYPQ1TXzCHxmbqOmWZfFAj3hBFimhgx+aPkNcHo+TlUrIgpSdUw/AeOp0xdZum/fY0YP4oqShyT0McxqZtn8/759ChPio/9EV8Zg6hKti3TxH7DHNHvK8QUpGGQ3yTFju47s4VyUrUMKfqnpKgbvwif+Jsv5fntJRYx72gwejo62T7u3dfUdn9i3o//xzPGqFXHTNiGGNXPhpsYFQw6oZC52dfVTS/STZAUNyXpSBWQ5sHHqHomhVzU++qswoqQpn9jtG7rBuVMUhe/b5jtHuOX/CqrO/nCc7/lfmYtmZvnnNelH6Inxj+w3zLeJPkLvo9JEycFw/03i/Tatf5O8Z4SWImqOqmpt12kPfjVDU6CH8X/fwItnH3y4iHJljkiJvQLpkJ+GDNhVFx/fTnwayQAmiX/ex77bYSK//jIOIg5JhgzPj76bc3sUMP4zIgVmBhViAlQ6FP/IVsmxAnVTYiqpn6pTQpqpooRfgijgnFW1pKZSZIhm+YrJp5rbusnGD130zIpdv+AMt4kSSPCaCQ8H6pIQ0KCz6Hw2UTd+M2eRvsRK7wyF1PXmCF9xVEzvzHz2Vw2rJWyms8smSLpEreruM5vQv/mLO9wj0oa3pkv/5BQTxnhp8J/myL+rV8a+HX8ZHQTFRHT76kpXh7JXL/MKr+vGVQckooUNBcwB79KaK1UM36FmMcUgaIeGh+ftv7dSeUXGcCVoQFVBtYjmHVbtuUXJcznPdq/LkqeF4Q3CU14w+Cc8IaPIg3rxt99hZIqm+ZsIX+6+r//+3/9H+adqoGV9SBDGVi9f14GTNmAq7lMY/hlpMe03zw+SjNLfnyZ15BN+8769O7f/WPN1J9rpkZFNMxR3UeB4bBnfLivMPPuSSpm+LhgGJCoZa7eXRi7+o8LVRTGhHl3pj0YVPsizKPzO7xhnJOI+fX0N2DmvJR9z7KvS4khcw6JYYMZVFCrMsNhQY7npPrG7w7+nl8QnIZ1jDA+1+c/+gnBM3TS3D1Ee8KUSYmo9w5qsq9C9P0Xlge/MAvUvEiyzEq6HqyAac3AXH5YSZ/e/XtIFT+8q3tYfry54SbTa348ur78vcF+g+rmJkeNP4z8xr95pDVMov+gZ8zqGuVUP7RMKPwcXQ8U++7uqY/4dPXut++3Fl+G7357xsyXK0ruvkqKhiH7M+MFOj6j29v8ykRNX09cctbjNPXTd7+9OPrLdU/SvGjh1YbrweP/qJFr1AyfSL17QeZfw9oX5ZzbvYAq6MnqDWGMJTgrw0A7mrWrl7jowzZdM3jlNL3Pvmi6aMobnoeGBx/vEfM/qb8MURGVJCmasyf/9la79+Wy5UIliej6n3S/X5i/MulnZlgxV9dmv89sqqTYXTF/OivkeaP7cOH14dLoXqc1KQaP299aefU3EmP+yvRGqnJmuP1bGRh8rxm//DiJGQ79fUP+lbAmoRKTliItQ+25taHVTrJNQho0zng7L3peeTLz2fN114PAr9FkxAwjZsj88Y9/ZN799uqXDV+YPzHvfnt+0/DlWUP46pSnuvYnZ7x4pfa7J1wI/eycDLX//9zmu3dUP/WVF7dQL53j+dTVj1af0f+k0Dd0R5VDdffMT75z+D8L6AeyaD6YlmbQEugmQoeb4pAjruAGpjWz5PMd1w/7nFf5aV9+xUjdkMrfoa/5aF8+jtEi6ulOaJBsmX9jdhUqKRYez/zC3JQVoeXJvmjqP/Rl8eBZWyeLJpPUfd/W0vq2QCEtO7dJVfclK63crJUqG0xSML+x19cCy375AxORwWNb1tDS7ZnwT2fQf0GF/PMl5TY5/1IRI1Qy3IBhIlKgweBrb5VsmY1ivmwpGR9XyI9aJvejvs3vZTxt64ek2JIfHZtn2/r6tK1fzA96FvrzVD/7Ti9LBUFMlFQobEjV9lcGSV0nRX/PkmdRUjHDl7o9k5tFEU2TfRW4rRs/6MNZr3C682zZd7894+XLSwtRViO09fe4qRmWYa+YvzINQszQf0aU8kBJvhSqZ8BAFI6mfJcU+9O5STmdG8cKUaSgkBTM0Dg89dnnbRRLz7RdoqqXlxT91jAmR7qLeXitqY/fjHxHKc+vc/oC6oLYpGaOVdLfCw8YpiH7MH6x++a6rMghoWwkxe4hpNCggvQx4KcLt8k/TTz4Wwqur96OyY52UtTJqeV7sx96IF7+9Fe+NAb3kWWPMfPHPzKypgz+fD6ovk7Jvip8HP1l0LQlYj4xV48jVwN0CvE+Qg/7Imn6a9arC9UaVYckRFd/GQz+XCdFVl+TffOVgn+sH3rmj34Txg+Y7OqrQVKU++ZyWft0BPOXwWM6ohvf/fbW3fmXq8GuIvvyoa+YPzFX337HcWktrwZ1UyE/f2tlf8N5NUAXq16HJEJhL39NiqsBVdLgBx3ZWQv/opj5GrnORrxUTbMo3dfN19mGMLi/bKPZwmcKUtC+vYj86nKP2/toUjO4v7VNMoRbuilAg1+YOvSLAkV9RCsrEqDoevALY2mS9vJeq0B00flWmQadKgnPdziXq9oCNUdSZQxGB4Rps1+TnNLvAfOfTLBvmCOiKeH3DRP7B8QkDVMlu7hhCnK8HjxF394xzsaMLn+/SaZDv0yuaxJmqLmObr7609+1jRxQVSURug5Jsf2u35n90r8M7nrlmj1MP718mn54P+nx9xV+53v6YYUw8aNz04pKv/o2H/2eKjInDWLOX348Wbm3xZnP+voZ5dyvsycq5z3/xT06+I8c4HH9+ajLtosWfrbnO4r7xpOGw98N/l8AAAD//3qJN2WzQQAA" -> "H4sIAAAAAAAA/9Q56XLjNpr/VZV3wCjeykz1UCJ12XLiqdFB6rBIWbx0ZFMqkIREiiDAJkBdnX6R/bN/9/H2EbZISbbsdneSqanaGf+xCXw3vtsdSjgiXDAPMboHUYp5EMOEl6Ngj7wfgUNT4sHk8FBUB6rcHltat6XPi4XsS7BRwgJK7oFUEr8rfFcQhGug7woX2t2AxZQFPIeFnEPXjxDhP4JVgBGBEXooBiTgJXe1Lr5gmQkkbIUSQSYu9QKyvge3TsCvAHKROdrzsotp6gkuJatg/V1BDSL0hXDfX8MUCilDCbsvACCATIJ7gNyKkB0WAACAMX8JU+7TJDgibxmiQw6b/QigyJgvJAyCVqvVale1I+xIB7ciZ5/d1qTVbrVandaks9+slMEA91Yd0gxc3D9E00RuJ6ZVwaMGD42eKaH41us8HXfSZt6YEn+Cn2ZqjJ6SQNtrM9y7c6fjZllX4rYnHpvKTjt8CFdrv7lKD9q81hx8UGFjfDDt9rrua1TZr/RZrx70uVs2Jpg4shI8xkZYw0FMa5MFb/No3fq4Do1Wo3v0D2unkdbVZrA3B/vatL1JDVXszSZHbROj1SGYph/YQP/gV6xkEj622mk6mE+cZIM/KL4dwdE22R7McSVlY74l8/bGd552h/FtZfq0gfGjV276Jvz4JEs75dCwlAqZubWn9U5cBxOnwQJHMY+3mon202p90rz7GE/GU3X+6MbrRYIN2O8/LgzV58fxreotkvFIsWbUkFqodaitfe5qybhtYqdubJ9uq8ej+LGtKxW3M66NxV1c3+0+PvnbXYVwpxqboyfuIT78YNfFyROJyexgGGQRV47KzkUVyZntG7fEb2Lij5LFeoNuXTohTy1lX3ZxtSEbw8M6SJ/c9u5DKN3NUzxXZ9ZH2ObhbjgK9U033pizCqqrQ6lBu7ds2Hdr5Wk9PKxGW09ltu99lDqzfs+2x/GRrh2xWbfngajPlJgs9LKE7HWnrH+Y2gc+X83vxGRlj12vRSu9xYoM68e5bs2Gw6a6CCHZ76vyrTUOQnmoNZm1qYjisdE5HMTBavDRdIZSu766XXlV6OrJqNZ155anDMpS+6BNG4q0uXUXQas3Hj5qznGmiGaVr+72IpImDw8gghua/D1Bng95yaVR8bW/I69Sr0vN3Oc7J5/Hi+5A0ky5np0NntrSRsG1uKGY7WDfNxu7cdiY3ZFNeXGL6JM2kcuquHus3dUfAXVSDwavmBV2ScDRMssI57CMIffvQZlH8Sm8l1mOWG5hwnLJ3FMWuAe/ngUdG21rMOouO2NVHZgPd1UXru5EEdUr9UrNqUm11e2q7qzqEIle1W1KFfeuKTUrZ+zOWH0aG7J+Qb9d1VG14XnN2p1UF1fQrTlitVFtuA2v2nSc2waqoDvJW71l3lp2ZN18GBkiHxlSR7e8oRm0u7o9tAxrMZyIiqXndyLvhNLQsHTZlrXuZLqYLUSlaljD9kLEttXVJmplftTsds8K65JTWYgoUutmN6zoPd9yKnrbE3V9asUjR4qHsL/YmKGi69bucYKVticuPuq2rU1C3J+Yiq1bStUT94Eq1uOF4jFXirvabLFxplrV6PkbM5Q+Tmbeky3bDdPWF8iSZNvUZrCnjc1Z3PZ2cXZXe3UXKjPTHuqeaJOppU8tW5F1WRG9SD0YG8W3q35i9sQ6suPGRNTaloiruqIsjJBvpyGmXqSNO7nMw45lKfKi4imWrMg57LTZzb4noaJNSDuZ2srcsDV1fvRH02msWTYmiLT1saW1VWk4UiNvoHfb+/lMOXqb9ePcHm7sUK1oWK0vQn+vW9YeWnt7Kt9V1e5QRxv7CCsxVavx3uzjvrXxqxaeb0cVbahOB3t307aRHZtzcQ9Vya3adnyY7KiodfVoXqVHc4ZrjqI1bMleWFKbTEI8gj2vPe4r3MWxoU6b0XyqH1DfNswOPzrhQjamvKZW3WR+VB4Xtp2qkcZUxYs72Ban3WFflxZdHXuaWVG2i1BPpord1Yk9MvreozX1emZfPxqyBqdTLfKwNzWUGGphreaJ3k7FCpyag/r86EvOrP1RtVuPlrxgU1mtLXoKNGXJnyo40M22Zsz0qSprA4O0q7qId3OCU8fGltPhR53YFaerb+2edEB9ukUzv+HKesUOpSc3VIbOJK45FVZ1sc3tvh3qPVuxpGHHrHht1eLS3JIMu2/7xqytO8dh6FQX+8dja69H8+PEqh1sS2t7ot2eTJWxLUs9feYNLBvLHbwwVLnZmWCs6CGtLszFXK2Gu0WvyVyj+TjHi3ge4tir6KkltRItlDpj2Wurth0aM0+fWlJnbik9Y+NhDa+PyGyHTmX3+BXc9gVXn3nKJGhWLWuhTSypM5nOa+/H1f7ZRyfruK2TuKJVMDZEt+4o8cgNBwdzKkEoK3tDxiqa7n2ziqeu6Vb1I+6Y9tDSibabEktU+4OqLunVuahTL1pLuqVtDUUJOtE+8cz2XLOa84WoV6Z9reP2mj2jP6yoMn8ypntTk+xHdTbfaT22NTAm076bOL3YsvvqdjyLd87GN+xoz92+tdVF6ck0rUdrOuxbHT6GGxu6RzvSxcUMyrWqaQ4ka8rtcXf46PR9bIQKs2b+YFLZd62eXbNCTZubSl2btap2r07G3fbIwJ6I7PZkPIlFq+JpE9KqarZtLKZ3omZZNUuODwZpHWEfbzVlWBvbQ12v8AOaaoYx86JJ6Fdg1deMaJG6FbU6NZoVbYolfeNzJEuNzkYT5yGtP4pxXbcUyejT/Tz0JNfS5o9V5dGydcvrNHXnOD94oTebW2HdkhajOVZrc9tXJ8fhWCPKBk6He3dj1RYbXTbCyaNBNGYad1W3r9XdjbLVZro4D4ephkNpMlObneCUk3WrLg9kTbGwPtRD3J3YunLK5eLj20phGKPlozw3li1de4AJuYc7ds+QmyDOIkjgGiX3KRMQZFyQ7pvV6m29IjVvm83mGeo+IBwlBOKlS6OYMpTknabA6DaphWd2htU2OvrgyRyMtaXa0lq9c5Fqad1/nDNLHeYmQZz15MIZRXBpFEHiCeFkjmnzwn9umLK67I8NU2up8vJJl5XB7IFx6GAkXDQQLhq8NVJ3oD+UEXfLlDlpgL23gIbc0WXTeNZM1rpP44FmLi199OBzHrP7cnkbu0gQXVhrSiuxenfXRI0abAi3XLx1tg1aeq166Vn1UoZYghE8UgJ3LOs0yhcBR2OrO22Znf5yNO4Z3+JbF2sruHKkelOqVb2qJEQJ4wQfoxKma/ab3J47mfes8MVBidMIv9/g/BzSTfDL+QNiTHfIW3o0ggFh4AH8DIocwah0pliiybr4V1D0U6fkJGj39nxHkxAlX16BCwcXggdQfF9qFwpuwksxyjq3s3Qngn9Yvn+aHG8sHVES8MR935TfAzW7BqdpME1gFgdgRRMwiOAagXbGBiUgIKA1NUrPWF3qsntwcY8o55G/c/5X2aNumk22ObnTWcnnES48E+j4yA0B2qLkAKoiYMilxGMAEg9gugacAnZgmK4vLBniwIMoogRUxauzDPgE+UK7lZkcQNdFjIFtALMpFvCUEIRzwggB7iMQXTRnFKNrPplaHohpwkHlTqpkQp1vs5+UIQA9L8mIY+pC7FPGr+7hibsXBeQ+Z/EimI2SYHUA3Icc7NAPCQKEcoAgD8g6wzuJhSKaHAAl+VdAGIfEfZav05c7j+dcBG6yZPTMOlhdcFOWvd3fwG39P64Ey161DtyDixG7OuY+IgDtkQvKKUvKuUplJyDlmB5p4lC+hBglV1rIhKXJyYQJpTxfXrAD4ygCASM/cLBKMX4trzIYyWeZc5SnltkH5WvJWQxd9Cz4nfil4DyIXsm9C7gfECD9k1V6G1p/UL3nAhajhAUsi7aztluYlHHgfC3//wtY4RST5wgJVmCHgAsJSBB0feB6pPQyp75kAm1syn+OfHjwEPnLPZgisAswBhDv4IGBNeIAgppYBT5KEHCQC7P4oSvg4iCzjYsSzl5bM3NqkPgIL12PgOnA7INWt6vLhvFGiGvLrWCA0XWYxgFZ/wPG+CbJLCPUatXro4Ry6lJ8SoVXF4xDnmbZviZW3zwXYAwDmnccDHwCnVY2KA+UQadlypknnfN24rOo7MLySV8hRXGW3sHnf0ip54rwm8p/WSL+lIM6kPnPj24g4oEch2X+ciFTel1VfmAAkW2QUJLVArCFSZD1SgzABIFLiUBe7hr3z6h/uKh8L2v2QB9rqqyZF2eeWLIlv2phPqYofduUXDeE5SAreIJzKnjCRSWBcbh+cSVVNoxWT34o/u9//9f/gBt1rA3MpWzLmpnH5/nAkHV70JGzHH4+yX0a8stnt2XKl72SLhvWyHy4+TPcMcA+MsAQ8YQIsTwLCEIuuJAmGNw8awWEC4DgUO8AijdnwYp/OVNFrk/BzYl2oZCkxI280zrJ9SPqgQ/73+EzJ1DxVhTfthICOKVEl2OASPaqQBAI3Z2K6jdW4H9kmb0XmI8wPvXnX9tmX3lnVrsFlFIQBzHKorfAaJq46P3dWeF70EP8VZEFg26pMNAMs6V15OWg+3DzZzczvDBiuVvel8tSo1mq1Gul8+8yhhwxXo4Qh4IHOSxfaAmB95eMR4sxFGX2ydoEAiNUKijWaPQ8RzwUbz69P1p8Fm4+XQnzuZiRe0oCwgFNT4ITtLuim7950UA87yfONetyncXpzadXrD+XcpLG2QpvEEqFy1/ZIzPEhWdSN6/I/Hu89tk4p3HPyQz0/OqcAr2vnYyho3VWtZPXfpGn7Qym8CZo8ph9NXRlJU84HQlbiFME/jOLFwERL6YB4adI/vStce/zGeVMJfAy+N+Yfj+DX8HmIxASUCwZOZ7Bk4Csi+BvJ4NcD7rLs6zL86Bb2jBKChf0b0EWfycx8CvIHymJgLD6vQIU3hvGz/8nA4IAU07/nXyti2JMD5mnhehwGm2ybidYBW6WNE7+dgK67jxBp3UNVyo4kKFGDQgeEMBPP/0Ebj69WbJ/Bn8DN5+uNw2frwbCN1ye+9oQHf7/3Pnd3dFv+vCr7dBrp72+Kn4N+uSVz8Z8x2pnFCEzTma7L8i7Cf8nkL88zVV4vKPbv4qvF+S2sTTMsZ51PmUPbctkGyGJSAXDbJnyabX11fHmTVlK4xcXZJwmcI1eylAaX86y3ul5FVQIVuBPYJ2gOHO1C8/PoBwnNOtKUsLZj3k3XLia5uS2AQKWj2uHrK0lyM26zVWQsLxTzRo2c6DKOggI+CSWSlVR/Pwj8GjhMo3xrGO7Uv6ZR/bjJAiedpOr4PS/coxQDKQCAB4lqFB4GamCFZgpxutJEkCcIOgdQAS9fLrPddyv2DIgK/o1tlG4YqX9ir26L+Qi5PxUGL4zwmaKIOAFCXI5TQ75piBgLCD5eiUKvSABwmvbnsi1PC+rjnnzt2IcOnkWyw2eYZ5e9ubTlSyfX79QJqqHVjDFnAERiEXwK+AIAQFeEc1kyEi+VioXQEeZOxryKCDp/jSb7E/zYoIyT0EuJUDQt8/j9Qkt86Ura8coyfWlJEd1fbrLsMDyraXuvzh5xyjXW5y8bzp7bMDALgnydXABAE5T13+FXS7FCd0GmRgBWS/dzDUyRfIc8JuAq+BfJh/8nj7rJdoxXWcDVBbk2cvnz77NHfH8K9/0Zik+zywpxuCnn4A8Vgo/nxix0oamCYHY+6XADzECD6B4OSkW0N7FqYeWKQl4vl0tnqkylGwDFxV/KRR+ZgEJWYmm/IUC3LFlLvwOctdfYrpmxUJA4pSfd7TPLMAvhUu1yxBvPn1rZf65WFgnNI2XeaP8AIpf/mvjPFEWC4wnCEbfgswXm8UCOr9qyaUecnP9GSXFQmakwlcGsZMV/k195iVznR7x3Cy1vE3K+MstpwDnO7asWkBAKMnGdeLB5Ly+zWM0YADny9ogRPiQITmo8D1gLiQEeXlGixPqIK9U+B6Y4+749TqLoAzotEzOkk4SuKfVzXlDSxDf0SQEGG0RzmZ8RqOMfu4wfwVOysEOZSXhBw58uEUg4CAJ1j4HhO5KhefsmwfG6TG98+8viqkA46DEqBsiXvLKL/H0h9DoFiVJ4KGSS8nq3bgzctBfCqPcuEbupg+vv5p3t43c/17c77SeFxKEKfROsyqKYfJlPfohM2REOQKn/3k8v3L+Fic5WemKcgRZ+EzlhPN36RLgXwuAC/yJ1RntbIXfwnnHcF9EkiB8V/i/AAAA//8zl3CmNSgAAA==" # forces replacement
      ~ vpc_security_group_ids       = [
          - "sg-02523067c19e4d4ba",
          - "sg-07a88a5868e40dd45",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sdb" -> null
          - encrypted             = true -> null
          - iops                  = 150 -> null
          - kms_key_id            = "arn:aws:kms:us-east-1:933752197999:key/9630f91f-f3c0-42eb-b65d-3defffc79926" -> null
          - tags                  = {
              - "AppCode"      = "IMGB-001"
              - "Name"         = "🏗 Internal Composer (stable)"
              - "ServiceOwner" = "Image Builder"
            } -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0789bee2463abeaba" -> null
          - volume_size           = 50 -> null
          - volume_type           = "gp2" -> null
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
        }


      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-028095c759a9cfee3" -> (known after apply)
          ~ volume_size           = 25 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
        # (1 unchanged block hidden)
    }

  # aws_launch_template.worker_external_x86 will be updated in-place
  ~ resource "aws_launch_template" "worker_external_x86" {
      ~ default_version         = 2 -> (known after apply)
        id                      = "lt-0a0bd62efe297d67e"
      ~ latest_version          = 2 -> (known after apply)
        name                    = "imagebuilder_worker_external_x86_stable"
        tags                    = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🔧 External Composer Worker (stable)"
            "ServiceOwner" = "Image Builder"
        }
      ~ user_data               = "H4sIAAAAAAAA/9RZ2XLjuHq+V9W8A+JxamaqQ4mLFstnPHVEidRKSuIq6iTlAkFIpAguJkFtPf0iucltHi+PkKIWt+zuWXOqUuObFoF/w4/v39DdJKY4poxxSPEjiApCgxRmtBYFe+z9DbhJEXswOzzdKUNFEqem2utozl2l/GIsnOVBEj8Crsp+U/mmwjC3RN9UrrJ7QZ4meUBPtJBSiPwIx/RvYBUQHMMIP90FcUCraLW++8xlZDDOVzhjpBglXhCvH0HLDegNwclkive0hkhSeAxK4lWw/qaiBBH+wrhvb2kqlSLHWf5YAYABpQWPACOeKRcrAACQ5/4zLKifZMERe88hPpxoyz8G3OW5z2Q5BJ1OpyMK6hF2uQPipfKz15l3xE6n0+3Mu/vNSh4OSX/VjdsBIoNDZGeSmBkmTyZNGup9g8Npy+vOjjtu4zTt2J+T2UJJ8SwL1L26IP0HZE/bNU1ORY89tuWdevgQrtZ+e1UcVKfeHn5QYHN6MCxx3fDVRN6vtEW/EQwoqulzEruSHIxTPayTIE3q8yUVabTuvKxDvdPsHf3D2m0WDaUd7I3hvm6Lm0JX2P5iflQ3KV4dArv4kA+1Dz5vZvNw3BGLYujM3WxDPsi+FcHJNtsejClf5FO6jR1x47uz3WHa4u3ZBqZjr9b2Dfgyk7idfGiaMh8vUH223rHrYO4288CVjWNLNfDeFhrz9sNLOp/aijNG6XqZER0OBuOlrvj0OG0p3jKbTmRzkehcB3cO9bVPkZpNRYO4DX07awnHI/siajKPutP6lN2ljd3uZeZvd3xMXSE1JjPqYTr6YDXY+SxO48VB1+Nlyh/lHcI85y72zVbst0nsT7LleoNbKJnHs468ryEiNCV9dFgHxQyJuw8h9+AUxFEW5gsUabgbTUJt00s3xoLHDWXENZNeKx8NUL1mN8LDarL1lNzyvReuuxj0LWuaHpO1y7YblhOw2kJO46VW47C17ta0D7Z1oM7KeWCzlTVFXifh+8tVPGocHc1cjEZtZRnCeL8XpJY5DUJppLZzc8Oz7LHZPRzY4Wr4YrgjTmysWitPgEjLJvUeckxPHtY48aDaTZnbtNAy6PSno7HqHhcyawh09bBnMTd/egIR3CTZ3zPs+ZBWURLdvcU79vhGg2ufMN89Y54se0NONaRGuTacidxGJvW0KRtisB8Yzd00bC4e4k1t2cLJTJ1LNYXdjesPjTFI3MKDwRtllV0WUPxcZoRLWKaQ+o+gRqP0HN7PZY543sIsP1mGzlngEfx8MXSqi+Zw0nvuThVlaDw9CAiuHlgWN/gGX3frXH3VWjXcVQNi1hNQm+PRQ5tr8xfu7lSZTXVJu7K3Vg0sND2vXX/gGuwKorrLCk2hiZqe0HbdVhPz+IHzVu+Vd567kmY8TXSWTnSuq5neyAjEnmaNTN1cjuasbGqnPZZ2Q26km5pkSWpvbi8XS1YWdHMkLllimT11rvDOUbXEvhk2OJdfsjhSGkYv5LW+b7q8JnqsptlmOnG5dAQHy40Ryppm7sZzIoseu3zRLEudh2QwN2RLM2XBY/eBwjbSpezliEt76mK5cW1V0Pv+xgi5l/nCm1mS1TQsbYlNTrIMdQH76tRYpKK3S8u9+pu9UF4Y1kjzWCu2Tc02LVnSJJn1IuWgb2TfEvzM6LMNbKXNOauKJksETZaXeki3dkgSL1Kn3ZPNo65pytKS92RTkqUTrd3uld/zUFbnsZjZluzolqo4R39i26lqWiTGsahNTVVUuNFEibyh1hP3zkI+epv12LFGGytUeJUojWXo7zXT3ENzb9nSg6D0RhreWEfIp4kipHtjQAbmxhdM4mwnvDpS7OEebUQLW6nhsHuocEiwrPQw3yWs2tMiR0iOxoLUXVltWpy1NDkxnodkAvueOB3IFJFUV+x25NjaAQ8s3ejSoxsuJd2mdUVAmXOUx0vLKpRIzRXZS7vEYu3eaKBxy55GPNXg5e0y1DJbtnpabE30gTc2ba9vDLSjLqnQttXII56tyylUw3rdY72dQmRoG8OGc/Q5dyG+KFZnbErL3JaU+rIvQ0PifFsmgWaIqr7QbEVSh3osChpLdk5MCtciptulRy22eLenba0+d8CDZIsXfhNJGm+F3AyF8sidp3WXzwVELGoNrFDrW7LJjboG74mKSTnH5HRrYPn6QtTc4yh0heV+fOzstcg5zs36wTJV0WMtcW7LU0vi+trCG5oWkbpkqStSuzsnRNbCRFgaS0cRwt2y386R3h47ZJk6IUk9XitMrpOpIdedSp6oWFaoLzzNNrmuY8p9feMRlayP2BBDl9+Nf4FXvPJqC0+eB23BNJfq3OS6c9upfz2u9q8Yna9TUYtTXuUJ0VnUcOV0gsLhwbA5CCV5r0tEwfbeNwRiIwMJ2pF0DWtkarG6s2OTVQZDQeM0wWG1xIvWnGaqW12Wg260zzxDdFSz7SxZjbcHahf12319MOIVic50e2+onDVWFs5O7edbnZDYHqDM7aemNVC200W6cze+bkV7igbmVmO5mWGYY9MeDcwuncKNBdHRijR2uYBSXTCMIWfa1Jr2RmN34BM9lHNz4Q/n/L5n9q26GaqqY8gNddERrH4jnvbEiU48FlvifDpPWZP31HncEVTL0pf2A6uaZt2U0oMed45wQLaqPKpPrZGm8fSAbVXXF140D30eCr6qR8sC8Ypg621etQmnbXyKJa7Z3aisEyaNMZs2NFPm9EGyd0KPQ6bqjAV5bFqa6XXbmnt0Dl7oLRwzbJjccuIQpe5YvjI/jqZqLG+gPdqjjVlfbjRJD+djPVZzQ38Q0EBtoI28VRca64SjQiUhN18o7W5wzsma2ZCGkiqbRBtpIenNLU0+53J2/L5SDKa68QR3eVnA0iTHWTXJ3SIgXjXJ1u+JO72eJun6E9fiqwJXbdarHHuhsafaWNKedX3yPJYc/bmjqU8wix/hLn/MMcowzSMYwzXOHoucwTCnDPfYFoRWg+farXa7faF6dDO8O/WqTEs2MSYX+bop6l1tODOGU/VZ6aid/qXMddTen1eWF26OsiAtu3rmwsKgJIpg7DHh3CFJ+6rf0Q1JOblL7SjS80yT5OHiKafQJZjBe4qzGBJml2Thpf2+8VtvqD3VMEW1i2+Zq7OvwqWuJhn667kktTebDlXj2dQmTz6laf5Yq709WPX1YFUYwWMSX+6wdtt2fE3lFwtVmkTk693IP8JkE/zH5QMSkuyw9+wlEQziHDyBf4A7imF0i5i7fwN3fuFWy1t8v372zZdb4KoBQfAE7r5uNYIMymg1xWWbdbHuLPAP2/dPs+Odp6MkDmiGvu7Kb4FSboPz6FZksIQcWCUZGEZwjYFYqsEZCGLQsfXqK1cvQfkjuGIgOuk43fPpV81LUFGOoSdx57WqTyNSeRXQ9TEKAd7i7AAEFuQYJbGXAxh7gCRrQBOQH3KSrK8qc0yBB3GUxEBgb9ZK4jPlZ9md0uUAIoTzHGwDWI6cgBZxjMlJMMaA+hhE15PnCcG3espjeSBNMgr4B44vjbrsln9FjgH0vKwUThIEiZ/k9GYfnrV7URA/nlR8NszCWbA6AOpDCnb4uwyDOKEAQxrE65LvbBaOkuwAkvj0FcQ5hTF6ta87kLrjS9iD+zLuX1UHqytvkZd39xNoNf71xrDyVhsAHRDB+c0y9XEM8B4jUCvyrHY6Us0N4lqaHJPMTegzJDi7OYUU50V2dmGWJPT00pAfcoojEOTxdxSsCkLe2isPJ9LF5hPLrGMMQO3W8jyFCL8a/sB+aTgNojd27wLqBzHg/hlHOqPxgo1gBXYYIBiDDEPkA+TF1c/j1OcYUKeG9H3kw4OH4x8egY3BLiAEQLKDhxysMQUQ1FkB+DjDwMUIlshJVgCRAMcUIJzR/K2byusEmY/JM/JiYA+NAbjUtndG3HpuBQOCbwGaBvH6TzjjV0WWsVCvC7dLWUITlJBzErjZyCmkRZnn6qzw7rpAnhOQnMpaDj6Cbqec54bysNsxpBIil4yV+XlUQ7B2Pi9T4LRMbODTnzrUay78zcN/mRz/5UTqwtx/vXQdxx448eQlXq5iqm/z6Xc5wPE2yJK4zIJgC7OgLMg5gBkG1+SIvRM0Hl9Z/3A6/VZSraE2VRVJNa5gnpuSKb2p0C8FLvC7cnzbddSCMtUz7jnVM9cjMTmF689QUiRd7/Slp7v/+a///G9wr0zVofFcztfGKT4vC7qkWcOuVGavy8oJ05BeP3sdQ7o+f2iSbk6Mp/vv4S4H+UsOchx7TITzUxZgmJPhTJERcP96KsBcCRg38Q7g7v5i2N0PF6kY+Qm4P8uuVLIiRpF3fvVAfpR44MP+d2DmTMq2WPZ9EWXAOdchSgCOy1sFDBMnu3M5+ZWX2j/y5rpnch8Tcm4Cf+nR9QadZdVicJGANEhxGb2VPCkyhL/+xFP5FvQxfVNewLBXrQxV3eioXel52Hu6/x6Vjmcm+QmWj7Ua12xX+Ua9evm3RiDFOa1FmELGgxTWrrKYwPuh1NHJcxyV/ikLZAwjXK3I5mTy2qw+3d1//Hr/+om5/3hjzKe7UtwsC2IKkuJseIx3N3JPd36nY3qqpJdidN0u4/T+4xvVn6onkfrFC+8YqpXrr/KSc0yZV1H3b8T8NW774pzzTOGWDnq9dZoAbaCenaHhdZBTnL3FxSltlzSVd0Fzitk3vX9Z8pjzErOFpMDg38t4YXDspUkQ03Mkf/y1qeLTheUiJfBK+t8YsT6Bn8HmBTAZuKvqJz6dZkG8vgM/nR1yO009X2x9vkxT1U2exJUr+69R3v1OYeBncLqkLALM6vcaUPnaxHf57xzAMLCgyV8Jaz2ckuQAynH5VBzOo01+xtlls0TZdXwB3c6pHQpWAYIUVysuzHGzDhgPMODHH38E9x/fPQJ/Aj+B+4+3k+ynmxnol9SE+HCaMN7o+v/C9VeeJn4TymdHnt4h3iL388bd1ynPsHx16pfeOzMwIT6cPPhOMMro/1Hw9Wpu4uKL0/z1IH5qDsrq8BWgl9WlSG9IKt8CY9qbvp0ZYoy9Mg+jJN7irKxHwamz7Kk6KEtsBnZlr7vDgMAiRn61giA9BcXdjacvY8KnW++XVerTHfjpp1sT/kIuvpbzIr34FeQ42wYIX/w7y3Ba9tPvH0O+y0GGo4Ti92yn2M8TFOJy8PqFNu4q7Szi8nL29/dufXxosewXzmSYbyr/GwAA//+CfBlf9R8AAA==" -> (known after apply)
        # (8 unchanged attributes hidden)



        # (4 unchanged blocks hidden)
    }

  # aws_launch_template.worker_internal_x86 will be updated in-place
  ~ resource "aws_launch_template" "worker_internal_x86" {
      ~ default_version         = 2 -> (known after apply)
        id                      = "lt-08f0a8a5c9c6547df"
      ~ latest_version          = 2 -> (known after apply)
        name                    = "imagebuilder_worker_internal_x86_stable"
        tags                    = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🔧 Internal Composer Worker (stable)"
            "ServiceOwner" = "Image Builder"
        }
      ~ user_data               = "H4sIAAAAAAAA/9RZ2XLjuHq+V9W8A+JxamaqQ4mLFstnPHVEidRKSuIq6iTlAkFIpAguJkFtPf0iucltHi+PkKIWt+zuWXOqUuObFoF/w4/v39DdJKY4poxxSPEjiApCgxRmtBYFe+z9DbhJEXswOzzdKUNFEqem2utozl2l/GIsnOVBEj8Crsp+U/mmwjC3RN9UrrJ7QZ4meUBPtJBSiPwIx/RvYBUQHMMIP90FcUCraLW++8xlZDDOVzhjpBglXhCvH0HLDegNwclkive0hkhSeAxK4lWw/qaiBBH+wrhvb2kqlSLHWf5YAYABpQWPACOeKRcrAACQ5/4zLKifZMERe88hPpxoyz8G3OW5z2Q5BJ1OpyMK6hF2uQPipfKz15l3xE6n0+3Mu/vNSh4OSX/VjdsBIoNDZGeSmBkmTyZNGup9g8Npy+vOjjtu4zTt2J+T2UJJ8SwL1L26IP0HZE/bNU1ORY89tuWdevgQrtZ+e1UcVKfeHn5QYHN6MCxx3fDVRN6vtEW/EQwoqulzEruSHIxTPayTIE3q8yUVabTuvKxDvdPsHf3D2m0WDaUd7I3hvm6Lm0JX2P5iflQ3KV4dArv4kA+1Dz5vZvNw3BGLYujM3WxDPsi+FcHJNtsejClf5FO6jR1x47uz3WHa4u3ZBqZjr9b2Dfgyk7idfGiaMh8vUH223rHrYO4288CVjWNLNfDeFhrz9sNLOp/aijNG6XqZER0OBuOlrvj0OG0p3jKbTmRzkehcB3cO9bVPkZpNRYO4DX07awnHI/siajKPutP6lN2ljd3uZeZvd3xMXSE1JjPqYTr6YDXY+SxO48VB1+Nlyh/lHcI85y72zVbst0nsT7LleoNbKJnHs468ryEiNCV9dFgHxQyJuw8h9+AUxFEW5gsUabgbTUJt00s3xoLHDWXENZNeKx8NUL1mN8LDarL1lNzyvReuuxj0LWuaHpO1y7YblhOw2kJO46VW47C17ta0D7Z1oM7KeWCzlTVFXifh+8tVPGocHc1cjEZtZRnCeL8XpJY5DUJppLZzc8Oz7LHZPRzY4Wr4YrgjTmysWitPgEjLJvUeckxPHtY48aDaTZnbtNAy6PSno7HqHhcyawh09bBnMTd/egIR3CTZ3zPs+ZBWURLdvcU79vhGg2ufMN89Y54se0NONaRGuTacidxGJvW0KRtisB8Yzd00bC4e4k1t2cLJTJ1LNYXdjesPjTFI3MKDwRtllV0WUPxcZoRLWKaQ+o+gRqP0HN7PZY543sIsP1mGzlngEfx8MXSqi+Zw0nvuThVlaDw9CAiuHlgWN/gGX3frXH3VWjXcVQNi1hNQm+PRQ5tr8xfu7lSZTXVJu7K3Vg0sND2vXX/gGuwKorrLCk2hiZqe0HbdVhPz+IHzVu+Vd567kmY8TXSWTnSuq5neyAjEnmaNTN1cjuasbGqnPZZ2Q26km5pkSWpvbi8XS1YWdHMkLllimT11rvDOUbXEvhk2OJdfsjhSGkYv5LW+b7q8JnqsptlmOnG5dAQHy40Ryppm7sZzIoseu3zRLEudh2QwN2RLM2XBY/eBwjbSpezliEt76mK5cW1V0Pv+xgi5l/nCm1mS1TQsbYlNTrIMdQH76tRYpKK3S8u9+pu9UF4Y1kjzWCu2Tc02LVnSJJn1IuWgb2TfEvzM6LMNbKXNOauKJksETZaXeki3dkgSL1Kn3ZPNo65pytKS92RTkqUTrd3uld/zUFbnsZjZluzolqo4R39i26lqWiTGsahNTVVUuNFEibyh1hP3zkI+epv12LFGGytUeJUojWXo7zXT3ENzb9nSg6D0RhreWEfIp4kipHtjQAbmxhdM4mwnvDpS7OEebUQLW6nhsHuocEiwrPQw3yWs2tMiR0iOxoLUXVltWpy1NDkxnodkAvueOB3IFJFUV+x25NjaAQ8s3ejSoxsuJd2mdUVAmXOUx0vLKpRIzRXZS7vEYu3eaKBxy55GPNXg5e0y1DJbtnpabE30gTc2ba9vDLSjLqnQttXII56tyylUw3rdY72dQmRoG8OGc/Q5dyG+KFZnbErL3JaU+rIvQ0PifFsmgWaIqr7QbEVSh3osChpLdk5MCtciptulRy22eLenba0+d8CDZIsXfhNJGm+F3AyF8sidp3WXzwVELGoNrFDrW7LJjboG74mKSTnH5HRrYPn6QtTc4yh0heV+fOzstcg5zs36wTJV0WMtcW7LU0vi+trCG5oWkbpkqStSuzsnRNbCRFgaS0cRwt2y386R3h47ZJk6IUk9XitMrpOpIdedSp6oWFaoLzzNNrmuY8p9feMRlayP2BBDl9+Nf4FXvPJqC0+eB23BNJfq3OS6c9upfz2u9q8Yna9TUYtTXuUJ0VnUcOV0gsLhwbA5CCV5r0tEwfbeNwRiIwMJ2pF0DWtkarG6s2OTVQZDQeM0wWG1xIvWnGaqW12Wg260zzxDdFSz7SxZjbcHahf12319MOIVic50e2+onDVWFs5O7edbnZDYHqDM7aemNVC200W6cze+bkV7igbmVmO5mWGYY9MeDcwuncKNBdHRijR2uYBSXTCMIWfa1Jr2RmN34BM9lHNz4Q/n/L5n9q26GaqqY8gNddERrH4jnvbEiU48FlvifDpPWZP31HncEVTL0pf2A6uaZt2U0oMed45wQLaqPKpPrZGm8fSAbVXXF140D30eCr6qR8sC8Ypg621etQmnbXyKJa7Z3aisEyaNMZs2NFPm9EGyd0KPQ6bqjAV5bFqa6XXbmnt0Dl7oLRwzbJjccuIQpe5YvjI/jqZqLG+gPdqjjVlfbjRJD+djPVZzQ38Q0EBtoI28VRca64SjQiUhN18o7W5wzsma2ZCGkiqbRBtpIenNLU0+53J2/L5SDKa68QR3eVnA0iTHWTXJ3SIgXjXJ1u+JO72eJun6E8dWBbbKPVQ59kJiT7WxpD3r+uR5LDn6c0dTn2AWP8Jd/phjlGGaRzCGa5w9FjmDYU4Z7rEtCK0Gz7Vb7Xb7QvXoZnh3alWZlmxiTC7ydVPUu9pwZgyn6rPSUTv9S5XrqL0/rywv3BxlQVo29cyFhUFJFMHYY8K5Q5L2Vb+jG5Jy8pbaUaTnmSbJw8VTTqFLMBPEFGcxJMwuycJL933jtt5Qe6phimoX1zJXX1+FS11NMvTXc0lqbzYdqsazqU2efErT/LFW26YIMyyC9Ta3YoWHhzZu1mGTaVG25W6bSfXtwauvB6+WjFUYwWMSX+65dtuafM2uLxaqNInI1zuWf4TJJviPywckJNlh79lLIhjEOXgC/wB3FMPoFlV3/wbu/MKtllf9fv3swC+3wFUDguAJ3H3dagQZlNFqistW7GLdWeAftu+fZsc7T0dJHNAMfd2V3wKl3Abn8a7IYIlLsEoyMIzgGgOxVIMzEMSgY+vVV65egvJHcAVKdNJxuufTr5qXoKIcVU/izmtVn0ak8iqg62MUArzF2QEILMgxSmIvBzD2AEnWgCYgP+QkWV9V5pgCD+IoiYHA3qyVxGfKz7I7pcsBRAjnOdgGsBxLAS3iGJOTYIwB9TGIrifPE4Jv9ZTH8kCaZBTwDxxfGnXZLf+KHAPoeVkpnCQIEj/J6c0+PGv3oiB+PKn4bJiFs2B1ANSHFOzwdxkGcUIBhjSI1yXf2SwcJdkBJPHpK4hzCmP0al93IHXHl9wA7svk8Ko6WF15i7y8u59Aq/GvN4aVt9oA6IAIzm+WqY9jgPcYgVqRZ7XTkWpuENfS5JhkbkKfIcHZzSmkOC+yswuzJKGn14j8kFMcgSCPv6NgVRDy1l55OJEuNp9YZh1jAGq3lucpRPjV8Af2S8NpEL2xexdQP4gB98840hmNF2wEK7DDAMEYZBgiHyAvrn4euT7HgDo1pO8jHx48HP/wCGwMdgEhAJIdPORgjSmAoM4KwMcZBi5GsEROsgKIBDimAOGM5m/dVF4nyHxMnpEXA3toDMCl/r0z4tZzKxgQfAvQNIjXf8IZvyqyjIV6XbhdyhKaoISck8DNRk4hLco8V2eFd9cF8pyA5FT7cvARdDvlzDeUh92OIZUQuWSszM+jGoK183mZAqdlYgOf/tShXnPhbx7+y+T4LydSF+b+66XrOPbAiScv8XIVU32bT7/LAY63QZbEZRYEW5gFZdXOAcwwuCZH7J2g8fjK+ofT6beSag21qapIqnEF89yUTOlNGX8pcPG+HN+2JrWgTPWMe071zPVITE7h+jOUFEnXO33p6e5//us//xvcK1N1aDyXM7hxis/Lgi5p1rArldnrsnLCNKTXz17HkK5PJJqkmxPj6f57uMtB/pKDHMceE+H8lAUY5mQ4U2QE3L+eCjBXAsZNvAO4u78YdvfDRSpGfgLuz7IrlayIUeSdX0aQHyUe+LD/HZg5k7Itln1fRBlwznWIEoDj8lYBw8TJ7lxOfuU194+8y+6Z3MeEnDvFX3qYvUFnWbUYXCQgDVJcRm8lT4oM4a8/A1W+BX1M35QXMOxVK0NVNzpqV3oe9p7uv0el45lJfoLlY63GNdtVvlGvXv6tEUhxTmsRppDxIIW1qywm8H4odXTyHEelf8oCGcMIVyuyOZm8drRPd/cfv97kfmLuP94Y8+muFDfLgpiCpDgbHuPdjdzTnd/pmJ4q6aUYXbfLOL3/+Eb1p+pJpH7xwjuGauX6q7zkHFPmVdT9GzF/jdu+OOc8eLilg15vnSZAG6hnZ2h4HeQUZ29xcUrbJU3lXdCcYvbNAFCWPOa8xGwhKTD49zJeGBx7aRLE9BzJH39t9Ph0YblICbyS/jfmsE/gZ7B5AUwG7qr6iU+nWRCv78BPZ4fcjlzPF1ufLyNXdZMnceXK/muUd79TGPgZnC4piwCz+r0GVL42Fl7+ywcwDCxo8lfCWg+nJDmAcqY+FYfzaJOfcXbZLFF2HV9At3Nqh4JVgCDF1YoLc9ysA8YDDPjxxx/B/cd3D8WfwE/g/uPtuPvpZgb6JTUhPpwmjDe6/r9w/ZX3i9+E8tmRp8eKt8j9vHH3dcozLF+d+qX3zgxMiA8nD74TjDL6fxR8vZqbuPjiNH89iJ+ag7I6fAXoZXUp0huSyrfAmPamb2eGGGOvzMMoibc4K+tRcOose6oOyhKbgV3Z6+4wILCIkV+tIEhPQXF34+nLmPDp1vtllfp0B3766daEv5CLr+W8SC9+BTnOtgHCF//OMpyW/fT7x5DvcpDhKKH4Pdsp9vMEhbgcvH6hjbtKO4u4PK/9/b1bHx9aLPuFMxnmm8r/BgAA///QkqUSGSAAAA==" -> (known after apply)
        # (8 unchanged attributes hidden)



        # (4 unchanged blocks hidden)
    }

  # aws_spot_fleet_request.workers_external_x86 must be replaced
-/+ resource "aws_spot_fleet_request" "workers_external_x86" {
      ~ client_token                        = "terraform-2021012814305742290000000b" -> (known after apply)
      ~ id                                  = "sfr-d731d94d-446d-470a-bfae-d1ff3ec03522" -> (known after apply)
      ~ load_balancers                      = [] -> (known after apply)
      ~ spot_request_state                  = "active" -> (known after apply)
        tags                                = {
            "AppCode"      = "IMGB-001"
            "Name"         = "External worker fleet - stable"
            "ServiceOwner" = "Image Builder"
        }
      ~ target_group_arns                   = [] -> (known after apply)
        # (10 unchanged attributes hidden)

      - launch_template_config { # forces replacement
          - launch_template_specification {
              - id      = "lt-0a0bd62efe297d67e" -> null
              - version = "2" -> null
            }

          - overrides {
              - instance_type     = "c5.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
        }
      + launch_template_config { # forces replacement
          + launch_template_specification {
              + id      = "lt-0a0bd62efe297d67e"
              + version = (known after apply)
            }

          + overrides {
              + instance_type     = "c5.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
        }
    }

  # aws_spot_fleet_request.workers_internal_x86 must be replaced
-/+ resource "aws_spot_fleet_request" "workers_internal_x86" {
      ~ client_token                        = "terraform-20210128143047325500000009" -> (known after apply)
      ~ id                                  = "sfr-3f5f659b-f419-494b-a88d-c8558bfd9947" -> (known after apply)
      ~ load_balancers                      = [] -> (known after apply)
      ~ spot_request_state                  = "active" -> (known after apply)
        tags                                = {
            "AppCode"      = "IMGB-001"
            "Name"         = "Image Builder internal worker fleet - stable"
            "ServiceOwner" = "Image Builder"
        }
      ~ target_group_arns                   = [] -> (known after apply)
        # (10 unchanged attributes hidden)

      - launch_template_config { # forces replacement
          - launch_template_specification {
              - id      = "lt-08f0a8a5c9c6547df" -> null
              - version = "2" -> null
            }

          - overrides {
              - instance_type     = "c5.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
        }
      + launch_template_config { # forces replacement
          + launch_template_specification {
              + id      = "lt-08f0a8a5c9c6547df"
              + version = (known after apply)
            }

          + overrides {
              + instance_type     = "c5.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
        }
    }

  # aws_volume_attachment.composer_external must be replaced
-/+ resource "aws_volume_attachment" "composer_external" {
      ~ id          = "vai-3319833951" -> (known after apply)
      ~ instance_id = "i-06756468fd2dbda0e" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_volume_attachment.composer_internal must be replaced
-/+ resource "aws_volume_attachment" "composer_internal" {
      ~ id          = "vai-1191377066" -> (known after apply)
      ~ instance_id = "i-09e9fa426e96bb81b" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 6 to add, 2 to change, 6 to destroy.
```

</details>

*Pusher: @ondrejbudai, Action: `pull_request`*